{"restaurant_name": "Baba Kabab", "overall_rating": "4.6", "nbr_of_reviews": "57", "reviews": [{"rating": "4.0", "review": "Chicken Gyros were very tasty. Could perhaps be more filling"}, {"rating": "5.0", "review": "This place deserves a 5 star! I ordered food for take out. The portion size is more than fair for the price. Customer serve was superb! Vegan options are always a plus 😊 thank you!"}, {"rating": "5.0", "review": "Excellent restaurant and best like Somali food, best testing and good staff . thanks I appreciate that baba kabab."}, {"rating": "5.0", "review": "It is a restaurant with a wonderful mood. The chef and staff  are really friendly. Above all, the cuisine is perfect!"}, {"rating": "5.0", "review": "This being a new place, we didn't know what to expect. It's small and sparsely decorated but the food was AMAZING. We got the beef plate and lamb plate. Both were juicy, full of rich flavors, and fell apart in your mouth. We'll definitely be going back."}, {"rating": "5.0", "review": "Flavorful and fresh food that is generous in portion! I got the combo platter. It is not on the menu for some reason but I called and they do have it.  I also ordered their falafel with hummus.  This is my new go to and obsession!"}, {"rating": "1.0", "review": "I will give ZERO stars to the food. KABABs were dry and overcooked. Please, the animal is dead already. Don't burn it to its second death. The cook needs some lesson in making kababs: You need a 80/20 ratio of meat and fat, else your koobideh's will be dry and tasteless. (2) add chopped parsley, red/green pepper to the koobideh. Revisit your butcher or make your own mince. If you need pointers let me know."}, {"rating": "5.0", "review": "Baba Kabab is a great place for anyone that likes falafels.  The taboulei is great, hummus is great, falafels are great and the service is even better.  The prices are fair and the portions were large.  Highly recommend."}, {"rating": "5.0", "review": "Amazing food! Ordered the tandoori chicken plate, beef kabab plate with hummus and pita bread...definitely recommend! I'll be ordering again in the future!"}, {"rating": "5.0", "review": "I love this place. The falafels are my favorite. The prices are reasonable and the portions are generous."}, {"rating": "4.0", "review": "This place is pretty good! It's definitely more of a mix of an Indian and Arab place instead of being more of an Arab place. The meat platter and falafel were tasty but the different kinds of meat just had the same overall taste, which it would've rated higher on my taste buds if there was some distinctive flavors instead just one."}, {"rating": "5.0", "review": "Good food and great service from the manager."}, {"rating": "5.0", "review": "I was looking for a middle eastern place near my job and got this place.  I got the chicken with rice, salad, grilled jalapeño with falafel and hummus.  Food was definitely not all middle eastern, it had an Indian twist to it that I loved!   It was pleasantly delicious.  I wasn’t crazy about there hummus, but it was really good lol  it was a lil pricey, but will worth it they are very generous with there food.  Glad I found this place I like Indian food too."}, {"rating": "5.0", "review": "Authentic Mediterranean food Thanks"}, {"rating": "5.0", "review": "They're falafels are AMAZING. I live near the place so i have the amazing advantage of going when ever. 10/10"}, {"rating": "4.0", "review": "For a kabob take out they are perfect. Don't recommend eating there. The staff are very nice and helpful."}, {"rating": "5.0", "review": "Fun foods.  Sauces are so yummy.  The lamb sandwich was seriously amazing!  Support your local business, give this place a try - you'll love it!"}, {"rating": "5.0", "review": "I love this place, great food."}, {"rating": "5.0", "review": "Welcomed Baba Kabab to the location. Had an opportunity to taste their food and it was delicious. Food is seasoned perfectly, well prepared and have a over all great taste. I am excited to have them here and wish them blessings and good fortune..."}, {"rating": "4.0", "review": "Did the door dash and didnt get my drink. Also loved everything besides the white rice and peta."}, {"rating": "5.0", "review": "Amazing food. Highly recomended place to eat grill and bbq food"}, {"rating": "5.0", "review": "Food was good, interesting fusion between Indian and Persian food. Great bread and falafel. We had lamb kabob plate and the falafel plate. Both good.\nPrice was fair and worth it. Excellent service.\nSanta recommends it."}, {"rating": "5.0", "review": "If your looking for a healthy Indian fast food cuisine, and you want to try a great new dining experience, this is the place!!! I had the Tandoori Chicken and it was spot on, entree came out hot, food was flavorful, and this will be my routine lunch spot moving forward. Great job Baba Kabas for bringing fresh, healthy, and tasteful foods to our area!"}, {"rating": "5.0", "review": "Seeing as there aren't any good kebab options in the area, I was very happy when I saw Baba Kabab opening up. Ive had the beef kebab platter a few times and it is fantastic! We will definitely be coming back."}, {"rating": "5.0", "review": "We are based in the same shopping center; and couldn't wait for them to finally open.  I popped in to say hi and welcome them to the neighborhood.  They came to our door later that day and surprised us with a little sampling of their food.  Falafel, Kebabs, Pitas, Hummus and rice.  Everything was delicious.  Will definitely be coming back for more.  Great to have such nice neighbors.  We wish them all the best!"}, {"rating": "5.0", "review": "Excellent food, friendly service, reasonable pricing. Will be back!"}, {"rating": "5.0", "review": "We just visited Baba Kabab at 2711 E. New York St., Aurora & were VERY pleasantly surprised at the wonderful flavors ! The baba ganoush, the lamb kabob plate & the chicken kabob plate were beautifully seasoned with spices !!\nThe cabbage slaw had fresh chopped vegies in it & tasted very good, also !\nWe appreciate good flavor & this place is loaded with it !"}, {"rating": "5.0", "review": "First time trying middle eastern food and i love it. Ordered chicken kabob and its amazing with great spicy  sauce. I highly hope everyone tries Baba Kabob 👍👍👍"}, {"rating": "5.0", "review": "Delicious food, friendly staff. Recommended"}, {"rating": "4.0", "review": "Nice falafel"}, {"rating": "2.0", "review": "We tried Baba Kabob on Monday 10/28/19 at 2:00 pm. We ordered the falafel plate and hummus plate. We dined in. We were the only customers there. There are four tables in the dining area, three were filthy. The floor was also filthy. When the food arrived it was on styrofoam plates. Only one pita came with the hummus plate. The food was good, but the falafel was a bit salty. I will not return because of the dirty condition of the dining area. They were not busy, so there was no excuse for not cleaning the tables and floor. I also was put off by the use of styrofoam plates. I’m so disappointed because I love falafel and want to support local non-chain restaurants. They need to step up their cleaning game!"}, {"rating": "5.0", "review": "They really have a very delicious kushari"}, {"rating": "5.0", "review": "Both the lamb and falafel plates were excellent. Large portions that will not send you home hungry."}, {"rating": "5.0", "review": "Awesome lamb Kabab sand falafel..\nGreat sauces to go with.. Ordered food from Baba Kabab using  Grubhub. Food was delicious and exactly what I ordered.. Thank you and I will recommend Baba Kabab to all my friends.."}, {"rating": "5.0", "review": "Very delicious food their tandoori is the best in Illinois"}, {"rating": "5.0", "review": "Really delicious food, prepared fresh! Would go everyday for takeaway if I lived near!"}, {"rating": "5.0", "review": "Saw this place on Uber Eats and decided to give it a try.  I am so glad I did. It was absolutely delicious. My picky son even loved it. He loved the chicken shish kabob and the Naan. I have found a new Go To spot! Highly recommend trying it out."}, {"rating": "4.0", "review": "Good food and great service!"}, {"rating": "5.0", "review": "I ordered a vegetable falafel plate on Uber eats and I loved it. Great food at an affordable price."}, {"rating": "5.0", "review": "Friendly owners and food is outstanding.\nSo glad they open up the new location."}, {"rating": "5.0", "review": "Had the chicken pita sandwich, it was spicy and flavorful!"}, {"rating": "5.0", "review": "Awesome people,   delicious food ,👌👌👌👌"}, {"rating": "5.0", "review": "Good and healthy food"}, {"rating": "5.0", "review": "Excellent food"}, {"rating": "4.0", "review": "Good food"}, {"rating": "1.0", "review": "If I could give 0 stars... I ordered food this evening. A mix platter and chicken kebabs. Picked up the food within 35 -40 mins. The good was cold, stale, rice was burnt!! The most tasteless food ever. I’m surprised how is this place even running. The chicken seekh kababs were hard, stale meat and hummus was bitter and HORRIBLE. The salad was watery. I called the restaurant to complain last called UDHAV. Picked up the phone instead of apologizing she kept arguing. She said I can complain where ever I want! Disgusting.. she said the owner SHRIDHAR will call me. Baba kababs is horrible. They ruined our family dinner! Disgusting food ever"}, {"rating": "1.0", "review": "(Translated by Google) mediocre\n\n(Original)\nMedioker"}, {"rating": "5.0", "review": ""}, {"rating": "5.0", "review": ""}, {"rating": "5.0", "review": ""}]}