{"restaurant_name": "Saravanaa Bhavan", "overall_rating": "4.3", "nbr_of_reviews": "1116", "reviews": [{"rating": "5.0", "review": "I have dined here multiple times and this place has never disappointed!! The staff is very friendly, the food is delicious and in recent times, they have also taken measures to ensure a safe dining experience (indoor and outdoor).", "identified_foods": []}, {"rating": "5.0", "review": "Very delicious and authentic Indian food. Nice and friendly service, fresh and hot food, great variety, value for money, awesome taste and overall very good food. Would definitely recommend it.", "identified_foods": []}, {"rating": "5.0", "review": "Food was delicious\nWe ordered meal lunch the quantity was a lot\nIt is better to order one lunch for 2", "identified_foods": []}, {"rating": "1.0", "review": "The food was horrible horrible !\nWe have tasted their food from other NY locations last year and it was soo good !\nThey are using chefs who have absolutely no knowledge of cooking .\nExtremely dissatisfied.\nWill not recommend to anyone .", "identified_foods": []}, {"rating": "5.0", "review": "I absolutely loved Saravanaa Bhavan. It gives you the authentic taste of South Indian food. Ordered Utthapams and Filter coffee with papadums. When torn for choices between South Indian food joints, pick this place anyday. The waiting time to get seats here is a bit more so be prepared but it's worth the wait.", "identified_foods": ["coffee"]}, {"rating": "5.0", "review": "More people should know about this spot. The dosas are delicious year after year.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Delicious south indian staples at affordable prices. Been twice in the past month.", "identified_foods": []}, {"rating": "5.0", "review": "The food was just amazing! Typical South Indian taste. As someone from Tamil Nadu, I’m always in search of the South Indian cuisine. Found this restaurant near my university. The food tastes the same as the ones at SB in Chennai. Had Sambar Vada, Rava Masala Dosa and Filter coffee. The waitress Rabina did her work perfectly!", "identified_foods": ["tamil", "cuisine", "rava", "masala", "coffee"]}, {"rating": "5.0", "review": "Great experience! The food and the customer service over here is awesome. Mr Vijay is very friendly and helpful. It was a delightful experience.", "identified_foods": []}, {"rating": "5.0", "review": "Very cool place with authentic Indian dishes. If u like exploring new things and cultures - this is a must try! We actually went back a second time even though Indian cuisine isn't my favorite. Just cause of the amazing experience we had there. Staff if extremely nice! One waited have us a dessert free of charge to try out!! O definitely recommend this place!!", "identified_foods": ["cuisine"]}, {"rating": "4.0", "review": "Good south indian food. They have some outside seating currently.", "identified_foods": []}, {"rating": "5.0", "review": "Good quality south India vegetarian food.  I feel good after eating there.", "identified_foods": []}, {"rating": "5.0", "review": "Ordered take away and it was super delicious. Hooked on this place and looking forward to my next order!", "identified_foods": []}, {"rating": "5.0", "review": "Don't listen to the haters. This place has excellent Indian food. Even though it's vegetarian I don't feel like I'm missing anything. Their Palak Paneer is way better than other Indian restaurants in the area.", "identified_foods": ["paneer"]}, {"rating": "4.0", "review": "Cheese Masala dosa was good. But the best were ghee mini idlis. Little morsels of heaven 😀", "identified_foods": []}, {"rating": "5.0", "review": "Great vegetarian spot in UWS. Their spinach based dishes are really well made. The paneer is also cooked to a point where there is a light burn but not crispy. The thali (special dish on the menu) can probably feed two.", "identified_foods": ["spinach", "paneer"]}, {"rating": "5.0", "review": "I’ve taken a few people here and will keep coming back for more!\n\nFOOD\n-Paper masala dosa (pictured below) has been my go-to. The bread is deliciously chewy towards the center with a nice crunch towards the edges. The dips keep the flavors interesting and have a mild spice here and there\n- Garlic naan comes in 4 pieces and is deliciously garlicky and fresh. The bread was straight out of the oven and into the basket. Would recommend this staple if you’re craving and if you will have enough space for the dosa!\n- Coffee is creamy and delightful! It really hit the spot at the end of the meal. It’s quite strong, so I wouldn’t advise if it’s late in the day and you are sensitive to caffeine\n\nAMBIANCE\n- Decent dining area that’s very clean! The staff wipes down the tables and chairs after every group\n- It can get a bit crowded, but it is a popular space after all!\n- Only downside is there is no AC. There are a few large fans, but if you aren’t one of the tables that are downwind, then you are out of luck!\n\nSERVICE\n- The servers are very friendly, but unfortunately very very busy (and possibly understaffed)!\n- It generally takes time to get seated as they wipe everything down and get set up. You need to be comfortable flagging down waiters for the menu and for water (and clarifying if everyone at the table wants water as well)\n- The food takes a bit of time, but it’s reasonable considering how the dosas are fresh! Just be prepared for a nice chat with your companions!", "identified_foods": ["masala", "bread", "dips", "naan", "bread", "dosas"]}, {"rating": "3.0", "review": "Food was good. Paper masala dosa was nice and Veg biryani was Ok.", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Good South Indian food on the UWS. Been visiting them for years!", "identified_foods": []}, {"rating": "5.0", "review": "Great experience! The food and the customer service over here is awesome. Mr Vijay is very friendly and helpful. It was a delightful experience. Will definitely visit again.", "identified_foods": []}, {"rating": "5.0", "review": "They made good food even better! Went in May 2020 and Thali veg was DALISH. I loved small okra nuggets. Fave was raita fresh, with red onions. Included potato masala, chickpea curry.. more. The food was served outside in take out containers and all was super clean and we felt safe. And got to take home leftovers.", "identified_foods": ["okra", "potato", "chickpea", "curry"]}, {"rating": "5.0", "review": "Had a great time at Saravanaa Bhavan all thanks to Vijay! The food tastes even better when you have good people around. Will definitely come back again.", "identified_foods": []}, {"rating": "4.0", "review": "Serves classic south Indian staple food. I tried the masala dosa & filter coffee here and both were pretty good. Service is decent but a bit slow. Definitely recommend to check it out if you want to try some Indian food other than Chicken Tikka Masala & the kind.", "identified_foods": ["masala", "coffee"]}, {"rating": "5.0", "review": "The closest thing to Indian food I had in India! Everything was delicious", "identified_foods": []}, {"rating": "3.0", "review": "Food was really good and consistent quality.\n\nHowever, space management is poor. The furniture and the way it's laid out is not fit for the tight space. Staff seemed distracted and were not great with maximizing table turnover during rush hour.", "identified_foods": []}, {"rating": "3.0", "review": "Always like the food here. My go to for South Indian. Ordered filter coffee this time around and it came with burnt milk. Had to send it back. Staff was nice to get it made again, fresh. Hygiene is not the best. The water glass had lipstick stains and that got me a bit uncomfortable with their silverware.", "identified_foods": ["coffee", "milk"]}, {"rating": "5.0", "review": "Casual spot. Dosas here are delicious! Service can be slow though, because there are a lot of takeout orders. We were a group of 8 and our fishes did not come out at the same time at all. But everything was tasty.", "identified_foods": []}, {"rating": "5.0", "review": "The food was very tasty! Felt like traditional South Indian food. We also met Vijay and he was very fun and entertaining! Excellent experience!", "identified_foods": []}, {"rating": "5.0", "review": "The foods are really good Vijay hosted us very nicely. Really had a great lunch time with friends. Will definitely come back again next time.", "identified_foods": []}, {"rating": "5.0", "review": "This place was awesome! Vijay, our waiter was cheerful, kind and overall really good. Great recommendations and great food. Definitely will come back!", "identified_foods": []}, {"rating": "5.0", "review": "Great food and great service  !!", "identified_foods": []}, {"rating": "1.0", "review": "I don’t understand the ethics of this business. Manager was asking too personal questions so he could determine the type of respect or a service that they could provide??Found dirt in the water then I asked to have a clean warm water but in return guess what I got: Server went and open the tap and bought the hot water that comes with the chlorine from the tap instead of getting it from the boiler (such a lazy bummer) as I have uploaded a picture to see the service was terrible. The chef was staring at us from the window while we were having our dinner so can you please teach your employees some manners and decency??? This is not wherever they come from. Please have some manners we are living in a civilized country forsake!!!", "identified_foods": ["boiler", "bummer", "manners"]}, {"rating": "5.0", "review": "The food was great and they give very large portions. Vijay was our server. He was amazing! Overall very good service and experience.", "identified_foods": []}, {"rating": "5.0", "review": "Me and my buddy stopped here for south indian food and it was awesome. Good hospitality and especially the guy Lincoln at the the front desk was very helpful. Really nice experience and will definitely come back if I cm here ever...5** for you guys..", "identified_foods": []}, {"rating": "5.0", "review": "It was one of the best South Indian meal I had outside India. The place had a warm, homely feeling and the waiters were very friendly. Ask for Vijay, he’s the best and will make sure you feel at home and are well fed! Must go.", "identified_foods": []}, {"rating": "5.0", "review": "The best South Indian food I have ever had outside of India! Only in New York for a few days and this one certainly one of the highlights. Our server Vijay was very kind, talkative and welcoming. Will definitely be coming back on my next trip!", "identified_foods": []}, {"rating": "3.0", "review": "Ordered the Kara Dosa. The filing tasted like Maggie Masala and wasn't that great. The only good food there was the Kesari Rawa (sooji halwa) 😍 if you have a sweet tooth, then you must try it.", "identified_foods": ["kara", "halwa"]}, {"rating": "5.0", "review": "From the first moment  you enter this place  team give you a pleasant feeling. Very congenial crew, it is a nice restaurant to go out with friends or with your date. Excellent  food, specialist  chef de cuisine, modest  cost and attentive  service. Warmly recommended.", "identified_foods": []}, {"rating": "5.0", "review": "Absolutely fantastic experience. The food was amazing and the service was impeccable. Vijay was our server and he was absolutely phenomenal, I will 100% be back here. Can’t recommend this restaurant more 10/10.", "identified_foods": []}, {"rating": "5.0", "review": "Delicious dosas. Delicious parotas. I would've given a 4 star but thanks to the hospitality of Mr. Vijay, I'm giving 5 stars!", "identified_foods": ["dosas", "parotas", "hospitality"]}, {"rating": "5.0", "review": "Vijay was so nice! Amazing service and great food. Would definitely recommend and come back", "identified_foods": []}, {"rating": "5.0", "review": "The food was some of the most delicious Indian food I have ever had. The service was very good and the people were very lovely. Vijay was very lovely and nice. The entire experience was amazing and I really recommend this place.", "identified_foods": []}, {"rating": "5.0", "review": "Love this place. And Vijay is a very attentive waiter. Food is delicious and healthy!! I always get the lunch special.", "identified_foods": []}, {"rating": "2.0", "review": "Expensive South Indian food restaurant. Except idly, quality of rest of the menu items is not consistent, if you are lucky you might get decent taste, else bad luck! Attached Burnt Mirchi Bajji and Burnt Plaintan Bajji (nothing like authentic south Indian bajji)  Google search for actual look of bajjis.", "identified_foods": ["plaintan", "nothing", "like", "south", "bajjis"]}, {"rating": "4.0", "review": "Authentic south indian food experience in New york city. This place offers a wide variety of south indian dishes similar to it's food chain back in India. The dishes are on the expensive side but the taste is worth it.", "identified_foods": []}, {"rating": "5.0", "review": "Great place for authentic south Indian vegetarian food", "identified_foods": []}, {"rating": "5.0", "review": "Wonderful food that brings good memories of home. Clean place and good quantity. Mr. Vijay was very friendly and helpful!", "identified_foods": []}, {"rating": "5.0", "review": "Tasty food with excellent service by Mr. Vijay. Missed home food badly, but this place gave us the authentic taste of home food for us again. Really loved this place, will visit again for sure!", "identified_foods": []}, {"rating": "5.0", "review": "Had a wonderful time second time here with colleagues. Staff was very friendly, thanks Vijay for an excellent experience. Food was fantastic as the first time. Highly recommend to visit for authentic Vegitarien Indian Cuisine.", "identified_foods": ["cuisine"]}, {"rating": "5.0", "review": "The hospitality was very nice. Also, make sure you ask for Vijay! He's the sweetest guy and made sure that we were not short of anything.\n\nThe food was sumptuous. A must visit for South Indian food when in NYC!", "identified_foods": ["hospitality"]}, {"rating": "5.0", "review": "Amazing experience! The food is lovely and the service is very homely. Vijay really treats you like his own family.", "identified_foods": []}, {"rating": "5.0", "review": "The food here was excellent, and the service doubly so - we were waited on by a very friendly man named Vijay. He was kind, courteous, helping to take pictures of us, and was very attentive (without being intrusive). The place was clean and orderly. Reiterating once again the food was delicious, some of the best Indian food I’ve had in months.", "identified_foods": []}, {"rating": "5.0", "review": "Great food and excellent service! Vijay was awesome and super friendly!  He’ll definitely take care of you!  Go now!  If I could give ten stars I would!", "identified_foods": []}, {"rating": "3.0", "review": "The food is very consistent here, and very good.  The atmosphere is not, nor is the service. It's Kosher, so it must be clean.  If it was not, I would not eat here.  As it stands, we come back regularly, as the food is unique (in our limited experience) and we enjoy it.", "identified_foods": []}, {"rating": "5.0", "review": "I took my girlfriend who was visiting from Toronto to this location. She is an avid lover of South Indian food. But what was amazing here was our server Vijay, he went above and beyond in his service. He is professional with a personal touch of his own style of service. It felt like home. He is an absolute asset to this location. exceptional!", "identified_foods": []}, {"rating": "5.0", "review": "Excellent South Indian food. Must visit if you are looking for authentic vegetarian food in NYC. Reasonably priced and we were served by Vijay who was very warm and friendly.", "identified_foods": []}, {"rating": "5.0", "review": "Home food was not missed. Thank you, Mr. Vijay for making us feel right at home with your hospitality! The food is amazing and the presentation - top notch! Definitely worth another visit!", "identified_foods": ["hospitality"]}, {"rating": "5.0", "review": "This is my go-to spot for a casual celebratory dinner! Delicious yet simple, and unbelievably potent (try the tomato chili onion Uthappam and you’ll know what I mean). Also, Indian desert is the best thing on the planet - get the Halwa!\n\nAnd did I mentioned the prices are more than reasonable?", "identified_foods": ["tomato"]}, {"rating": "5.0", "review": "Vijay is very nice and passionate about his service. Definitely check it out for yourself. Food is great too!", "identified_foods": []}, {"rating": "5.0", "review": "Really amazing place with great food...\nVijay makes the experience even more mesmerizing...\nAnd don't forget to have the filter coffee...", "identified_foods": ["filter"]}, {"rating": "5.0", "review": "Amazing Masala Dosa and tea. It tastes like the dosa during my stay in south india :) Furthermore you can sit outside and enjoy the evening.", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Ah I come here when I miss South Indian food!! Reminds me of home :) Vijay is great! The poori’s are awesome:", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food and fun atmosphere! Service was incredible and friendly ask for Vijay, he will take care of you. This is my new favorite spot!", "identified_foods": []}, {"rating": "5.0", "review": "It is always a pleasure to visit this place for the food and the service. Mr vijay ensured that me and my friends have a great time and experience since it was their 1st time!", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food. Great Service. Appreciate Vijay's service for attending to our table! Cheers!", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was excellent and very helpful. The food was great. Our orders were brought out on time and delicious.", "identified_foods": []}, {"rating": "5.0", "review": "My second visit to Saravanaa Bhavan NY, with my friend. Liked the food, and of course the Madras Filter Coffee in tumbler/ davraa. The hospitality of the staff was good, especially Vijay Anna. He made us feel home. I will go back sometime soon!", "identified_foods": ["coffee", "tumbler", "hospitality"]}, {"rating": "5.0", "review": "This is an amazing place! Vijay is delightful, and the food is exquisite. We'll be back soon!", "identified_foods": []}, {"rating": "5.0", "review": "Authentic food. Hygienic and clean space. Friendly staff members like Vijay further enhance the dining experience. He shared his experience about the city and his travel experiences.", "identified_foods": []}, {"rating": "5.0", "review": "Excellent South Indian food. Even better filter coffee! Reminds me of home!\n\nThanks for the warm welcome, Vijay!", "identified_foods": ["coffee"]}, {"rating": "5.0", "review": "Great food and great service! Vijay was our server and he is very helpful and nice. I will be returning very soon.", "identified_foods": []}, {"rating": "4.0", "review": "Authentic. Menu is comprehensive. Servers are around. Food’s very good!\n\nSeating is cramped so beware with bringing large crowds.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing ambience!! The food was absolutely amazing — Vijay provided us with great service and made our night. Highly recommended!", "identified_foods": []}, {"rating": "5.0", "review": "Excellent food, favourite Indian neighbourhood spot! The service is incredible. Vijay is always an amazing host and makes it a memorable experience!", "identified_foods": []}, {"rating": "5.0", "review": "Vijay, our server, was very friendly and efficient. The food was delicious and the restaurant was clean. Overall, a great experience!", "identified_foods": []}, {"rating": "4.0", "review": "Very nice food and authentic taste. We tasted several items and everything was well prepared. Dosas are absolute best with several chutneys. Staff was courteous and friendly. Must try ☕ as well.", "identified_foods": ["chutneys"]}, {"rating": "5.0", "review": "Loved this place for dinner, so fresh and good!! Had the best Chai in the city.. Vijay was also so awesome and great energy. Ask for him, and totally recommend this place. Thank you!!!", "identified_foods": ["chai"]}, {"rating": "5.0", "review": "Vijay was an amazing waiter. Constantly checked up on us and made sure everything was good. Good service and amazing experience all around.", "identified_foods": []}, {"rating": "4.0", "review": "Food and service were amazing! Really excellent.\n\nOnly downside was the manager literally pressuring me and my cousin DURING the meal to leave a review. Sorry, that is unacceptable.", "identified_foods": []}, {"rating": "5.0", "review": "Fantastic meal! Very friendly staff, thanks Vijay for a wonderful evening!", "identified_foods": []}, {"rating": "5.0", "review": "Great place! Very authentic dosas. The servers are very friendly and sweet especially Vijay. Makes me want to come back just to say hello to him! Love this place and have been coming  for years and will continue to do so!", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Good hospitality. Great food. For about $20 per person, good value. They also have outdoor seating which is nice for a sunny day.", "identified_foods": ["hospitality"]}, {"rating": "5.0", "review": "Loved the service! Super Lively place with an amazing ambience! Ask for vijay! He’s cool", "identified_foods": []}, {"rating": "5.0", "review": "I have been to Saravanaa Bhavan at Lexington many times and it's my first time to come to this location. Food is amazing and the ambience is wonderful. Vijay is a fantastic customer service and nice. Highly recommended!", "identified_foods": []}, {"rating": "5.0", "review": "Very good south Indian food. Excellent hospitality , especially five stars for server Mr Vijay who was very quick in attending  to our orders at the restaurant and had a welcoming smile all the time which helps keep up the vibe of the restaurant lively .", "identified_foods": []}, {"rating": "5.0", "review": "Awesome food and wonderful service by vijay🔥🔥. Quick, friendly and soothing service by vijay which really gave the necessary energy that we needed for the day. Was really missing the south Indian cuisine for a long time and today they made my day. ❤️😁", "identified_foods": []}, {"rating": "5.0", "review": "This is the most authentic spot for Indian food in NYC. Really love the dosa and more traditional South Indian fare. Vijay provided us with amazing service. Highly recommend.", "identified_foods": []}, {"rating": "5.0", "review": "One of the best places in the city, had the best time here. The food was amazing and just like India. It's a must visit for anyone craving Indian food in NYC. Loved Mr. Vijay's service and hospitality!", "identified_foods": []}, {"rating": "5.0", "review": "Brilliant South Indian food on the Upper West Side! I'm a frequent customer here and I love the South Indian Thali. It's a steal on weekdays at 13 bucks. Also, my man Vijay is an amazing guy! Make sure to meet him; he's got some great stories.", "identified_foods": ["upper"]}, {"rating": "5.0", "review": "It’s a wonderful restaurant and a good option for vegetarian people. Vijay is super friendly and I definitely recommend it.", "identified_foods": []}, {"rating": "5.0", "review": "Great authentic south Indian food, true to the original South Indian brand. Great service as well. Mr. Vijay was really friendly and caring. Highly recommend!", "identified_foods": []}, {"rating": "5.0", "review": "Great food!! and service by Vijay. Will definitely go back again :)", "identified_foods": []}, {"rating": "5.0", "review": "amazing food and great service! Vijay had great recommendations too. Will be back!!", "identified_foods": []}, {"rating": "4.0", "review": "Tasty food. Below average ambience. Very small dining area.", "identified_foods": []}, {"rating": "5.0", "review": "Excellent service from Vijay! We usually go to the other SB downtown but we’ll go here to the one on Amsterdam from now on. Great food-great price and excellent service! 5 stars⭐️⭐️⭐️⭐️⭐️", "identified_foods": []}, {"rating": "5.0", "review": "Best service ever from vijay! Made me feel like im back home :)", "identified_foods": []}, {"rating": "5.0", "review": "Amazing lunch. Definitely try the mini meals, a whole range of Indian food available at a great price. Vijay was great fun and kept us entertained throughout the meal.", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was so kind and served us so well throughout our lunch. Would definitely come back to just hang with Vijay! The food was amazing too, so that was a plus.\nThank you, Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Amazing service, Vijay is super and friendly  - and a go to man for friendly service.\nAny one who thinks of authentic South Indian veg cuisine - should definitely visit this place.", "identified_foods": ["cuisine"]}, {"rating": "5.0", "review": "Had a great experience tonight with Mr. Vijay. He was very friendly, courteous and warm. Enjoyed great food but enjoyed even better service. Thank you Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "I love this place; it always feels and tastes like home. The dosa is always crispy, the saambar and chutney just the right amount of tangy and spicy. The desserts are mouth watering. I tend to go here for some comfort food because it tastes just like mom's cooking. Coupled  with the fact that Vijay treats everyone like family, I want for nothing when I'm here.", "identified_foods": ["saambar"]}, {"rating": "5.0", "review": "Amazing food, and Vijay was super friendly and helpful. Love this place!", "identified_foods": []}, {"rating": "5.0", "review": "Really great! Vijay was very friendly and attentive! Will come again!", "identified_foods": []}, {"rating": "3.0", "review": "I really like the food but the service is not good. Servers are always in hurry to kick you out of the place and they are not coordinated well among themselves. If you can ignore the bad service, food is good!", "identified_foods": []}, {"rating": "5.0", "review": "Had a really delicious meal tonight for my mother’s birthday dinner! The food is always excellent and Vijay is a great server and is so friendly and welcoming!!", "identified_foods": []}, {"rating": "5.0", "review": "Amazing service by Vijay. Tasty food. 100% recommend", "identified_foods": []}, {"rating": "5.0", "review": "Great service from Vijay. Great food tasted and was fast service. Would visit again.", "identified_foods": []}, {"rating": "5.0", "review": "Great place and great food. The uthappams were really good. Vijay is very friendly and helpful with great suggestions. They are open to customizing existing food options.", "identified_foods": []}, {"rating": "5.0", "review": "I had an amazing experience at the restaurant.High quality south Indian food couple with excellent service. Vijay was our server. His service was brilliant.", "identified_foods": []}, {"rating": "5.0", "review": "Their food is really amazing and customer service is more amazing specifically\nMr Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "Stopped in for a quick meal while on a restricted diet and away from home.  Vijay took such great care.  The food was great, I got what I needed, and he threw in a sweet lassi.  That is the traditional Indian way: to look after guests, and I am very grateful for such consideration.  Will be back for sure!", "identified_foods": ["sweet lassi"]}, {"rating": "5.0", "review": "Great food and great price. I always get the veggie dosa or the parotta. The dosas are perfectly made - crispy and chewy and the chutneys are made just right. Vijay provides impeccable service and makes sure everything is perfect.", "identified_foods": ["dosas", "chutneys"]}, {"rating": "5.0", "review": "Amazing food! The taste is an explosion of flavors on your mouth. Ask for the basmati Tea.\nThe attention is good. Thanks Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Good food. Our server Mr. Vijay was very energetic and quick to attend to our orders", "identified_foods": []}, {"rating": "5.0", "review": "Delicious food!! Love coming to this restaurant! Vijay is a great server!", "identified_foods": []}, {"rating": "5.0", "review": "Visiting NY from out of town with my 4 grown children and chanced upon this place. We were happy with the food and even happier with the service by Vijay. He made us feel at home and made sure our vadas were super fresh, hot and crispy. I recommend this place 100% and will definitely come back the next time we are in NY.", "identified_foods": []}, {"rating": "5.0", "review": "All meals are vegetarian. Variety of choises. Quick service. Nice waiters.", "identified_foods": []}, {"rating": "5.0", "review": "After returning from a month long trip to India, my taste buds were craving for more Indian food. When I think of South Indian food, the only place I go to is SVB where I get the taste of home away from home. This particular visit was quite entertaining as we were greeted by this friendly waiter, Vijay. Good food, good chat makes up the best Sunday brunch :)", "identified_foods": []}, {"rating": "5.0", "review": "Best dosa in NYC!! Bhaturas are also super size here. Excellent ambience and service!", "identified_foods": []}, {"rating": "5.0", "review": "Just recently celebrated my birthday here, really wonderful staff especially the host vijay  was really wonderful", "identified_foods": []}, {"rating": "5.0", "review": "This was the best experience ever, my friend recommended this and we had a great time! Vijay was a great host and recommend the best dishes !\n5 star everything. !!!! Thank you", "identified_foods": []}, {"rating": "5.0", "review": "Visited for lunch.  The dosa are amazing.  Also had the fried plantains as a starter.  Excellent.  Very friendly and knowledgeable servers.   Great service.", "identified_foods": ["plantains"]}, {"rating": "5.0", "review": "Amazing food. Vijay was really friendly. Definitely coming back with some more friends. Loved it!", "identified_foods": []}, {"rating": "5.0", "review": "The food was excellent and our waiter(Vijay) did a marvelous job. Highly recommend", "identified_foods": []}, {"rating": "4.0", "review": "Great food quality. Only one attendant who also does cleaning and serving very calmly. Small place. Very crowded. Waiting time at 1.30 around 15 to 20 minutes.    Service was quite fast. If you are looking for authentic south indian food in NY, best place to visit. We enjoyed the food.", "identified_foods": ["calmly"]}, {"rating": "5.0", "review": "My wife and I had a great time eating dinner here. The thali reminds me of the thali I used to eat at woodlands hotel in Chennai. Our server Vijay was very friendly and helpful.", "identified_foods": []}, {"rating": "5.0", "review": "Delicious vegetarian food - the dosas are a standout, very crispy and light. Vijay was a charming & attentive waiter.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Very good comfort food. Makes you feel right at home. Excellent service by Mr. Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "Good South Indian food options. Vegetarian options only. Highly recommend", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was a great. Very good food, cant recommend it enough", "identified_foods": []}, {"rating": "5.0", "review": "Food really hit the spot. The Thali had more variety than the Lexington branch. Our server, Vijay was very friendly and made the whole experience very memorable. Will highly recommend him.", "identified_foods": []}, {"rating": "5.0", "review": "Great food and good value! The staff was very accommodating and helpful, especially Vijay. Great service and food, definitely coming back here!", "identified_foods": []}, {"rating": "5.0", "review": "Food was amazing at this place, staff (vijay) was friendly too. Being here felt like home", "identified_foods": []}, {"rating": "5.0", "review": "Amazing dosas, good amount of spice. The service from Vijay was fantastic, took care of our big table, recommended the best dishes and brought everything on time. Would come again!", "identified_foods": []}, {"rating": "1.0", "review": "Very poor service with extremely rude waiters.\nPeople ask to be served water to them after waiting fo 20 mins.\nThey think memorizing a customer’s order is the best way to take it which they would obviously forget after 5 mins and don’t care to serve it thereafter. We observed a “seamless” delivery guy waiting for 50 mins to get his order. Every waiter completely ignored this guy.\nThe manager was really rude with a complete lack of customer service knowledge. He was literally yelling at people waiting to give orders.\nI wont ever visit this place because the food was not worth this nuisance.", "identified_foods": []}, {"rating": "5.0", "review": "Great service by Vijay.. Best place for authentic Indian food. Must visit.", "identified_foods": []}, {"rating": "5.0", "review": "Always love this place. Vijay is very helpful and courteous. He went out of his way to help me prepare my take out. Thanks Vijay. Will be sure to come back soon.", "identified_foods": []}, {"rating": "5.0", "review": "Great south indian food. Our server - Vijay was extremely friendly and he provided wonderful service. I will definitely visit again because of Mr. Vijay's delightful service. They have restaurants all over the world in many countries such as Germany, Hong Kong, UAE etc. In the US, they are in New York, New Jersey, Texas and California.", "identified_foods": []}, {"rating": "3.0", "review": "Lackluster service. Food is ok. Adyar Ananda Bhavan is a better option.", "identified_foods": ["adyar", "ananda bhavan"]}, {"rating": "5.0", "review": "Food was delicious!!! Vijay was our host and he was excellent! He was very fun and entertaining!!", "identified_foods": []}, {"rating": "5.0", "review": "Awesome awesome restaurant. Everything was great!!! Order anything and you will be satisfied\n\nVijay gave us great service!!!", "identified_foods": []}, {"rating": "5.0", "review": "Super yummy, everything's made perfectly and service was super fast for lunch.  Our server Vijay was awesome and very polite.  All vegetarian, it was so nice to be able to choose from an entire menu for once!", "identified_foods": []}, {"rating": "5.0", "review": "Great food. If you go there, ask for Vijay. The service is fantastic and they are super kind.", "identified_foods": []}, {"rating": "5.0", "review": "The food was really good and our server Vijay was awesome!", "identified_foods": []}, {"rating": "5.0", "review": "Best Dosa and sambar we had ever had! We ordered Onion Chilli Masala Dosa, Aloo Paratha, and Chai. Everything was great.", "identified_foods": ["masala", "chai"]}, {"rating": "5.0", "review": "Great masala dosa and South Indian coffee!! Our server (Vijay) was super sweet and helpful, had a great dinner!!", "identified_foods": ["masala", "coffee", "sweet"]}, {"rating": "5.0", "review": "Amazing food, even better service! Vijay was a great host and helped us make the choices in a fairy large offering.", "identified_foods": ["fairy"]}, {"rating": "4.0", "review": "Small dining area and wait time will be there.. only 2 staffs in floor so we it takes time get seated. Food is authentic south Indian and tastes good", "identified_foods": []}, {"rating": "2.0", "review": "Horrible service with kitchen guys staring at you while dining. Food used to be very good but now quality has gone down. Only Dosas are good.", "identified_foods": []}, {"rating": "5.0", "review": "Thank you Vijay! Great experience! Great food. Definitely will be back.", "identified_foods": []}, {"rating": "5.0", "review": "Fantastic food and fantastic service! Vijay is the best waiter there is. Definitely will be back.", "identified_foods": []}, {"rating": "5.0", "review": "This is my second time visiting the restaurant, and I returned as a very happy customer yet again!\nThe dosas are amazing, just the way we would expect them to be at home, and the service is even better. Vijay always makes us feel welcome and at home. Having meals here is an incredibly comforting and satisfying experience.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Literally everywhere in the world, Saravanaa Bhavan is where I can find fantastic, authentic, South Indian food. We had ghee and rava dosas that were excellent. The pav bhaji was fantastic too. Don't miss the filter coffee made Chennai-style, served with milk in a steel tumbler. Special thanks to the hilarious Mr Vijay, who was such a cool guy!", "identified_foods": ["dosas", "coffee", "milk"]}, {"rating": "5.0", "review": "Vijay was awesome and helped me and my friends 5 star", "identified_foods": []}, {"rating": "5.0", "review": "Saravana Bhavan was very yummy! Vijay was very kind and helped us choose food. Thank you! I came with my friend from Korea. We will return again!", "identified_foods": []}, {"rating": "5.0", "review": "Excellent place for South Indian fare and vegetarian meals! Really helpful staff and amazing service by Vijay also.", "identified_foods": []}, {"rating": "3.0", "review": "Great dosa and idlis, but it was Vijay, and his most warm welcome that made this a memorable experience. Thanks Vijay! :-)", "identified_foods": []}, {"rating": "5.0", "review": "Thanks for to Vijay Anna for an awesome dining experience! :D", "identified_foods": []}, {"rating": "5.0", "review": "This is my go-to place for food that reminds me of home! The weekend thali is as good as anything you might get served during a Tamil wedding feast. The staff is friendly too, ask for Vijay!\n\nI'm a longtime customer and will return as long as this place stays open.", "identified_foods": ["tamil"]}, {"rating": "5.0", "review": "Great place for authentic south indian food. Vijay, our server, was super nice and made sure we had a good experience.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food and services. Vishal was especially a very nice and patient", "identified_foods": []}, {"rating": "5.0", "review": "Vijay is the best!  Dosa, Idli, Batura - everything hit the spot!", "identified_foods": []}, {"rating": "5.0", "review": "Awesome food, good service n Vijay is the best host , he is too gud to serve n take proper care .must visit if u r a South Indian food liver, there paper dosa, filter coffee n rava kesri is worth to enjoy.keep it up..", "identified_foods": ["filter", "coffee", "kesri"]}, {"rating": "5.0", "review": "One doesn’t need to write a review for Sravana Bhavan but I am writing this to talk abt the quality of service. Our waiter Vijay was very friendly and made sure our orders were accurate and served timely. Special thanks to him for the awesome filter coffee! Definitely coming back.", "identified_foods": ["sravana bhavan", "coffee"]}, {"rating": "5.0", "review": "Very amicable atmosphere. The dosa was amazing, and you need not ask about South Indian dessert AND you haven't eaten in HSB if you did not have the MADRAS FILTER COFFEE!! :D\nPrompt and very friendly service by Mr.Vijay!! It sure feels awesome to communicate in mother tongue, Tamil..!!\nThanks for making my first day in NYC awesome!\nHappy stomach, happy life! :)\nDefinitely a go to in NYC!!!", "identified_foods": ["tamil"]}, {"rating": "5.0", "review": "My first in this restaurant. The service was great and the food was amazing. I definitely recommend it", "identified_foods": []}, {"rating": "5.0", "review": "Very Good service and tasty food. Ambient atmosphere and easy to get to.", "identified_foods": []}, {"rating": "5.0", "review": "Very good food and Vijay is very friendly and awesome !", "identified_foods": []}, {"rating": "5.0", "review": "Vijay Anna is the kesari baath side to the authentic and finger licking South Indian comfort food that makes me feel like I'm home away from home.\nA must visit to anyone in NYC and wants a taste of India.", "identified_foods": ["kesari"]}, {"rating": "5.0", "review": "The food here is great! Really authentic & the staff is very friendly, especially Vijay. Excellent service!", "identified_foods": []}, {"rating": "1.0", "review": "The food quality is on an downward spiral. They were great , but off late the place hasn’t been able to keep up with its food quality.", "identified_foods": []}, {"rating": "5.0", "review": "I had the Kara Dosa and it definitely lived up to its name. Ask for Vijay, his candor and bubbly nature kept us entertained throughout!", "identified_foods": ["kara"]}, {"rating": "5.0", "review": "Great experience, yummy food! You won’t regret this experience, it is not only for the vegetarians but anyone looking for some authentic Indian food! Vijay was our awesome waiter!", "identified_foods": ["vegetarians"]}, {"rating": "5.0", "review": "One of the best Indian food experiences in NYC! Great food, great service! Thank you Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Great food. Super friendly staff. I loved my Palak Paneer!", "identified_foods": ["paneer"]}, {"rating": "5.0", "review": "Great food as always! Very welcoming staff. Highly recommend getting Dosa.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food. Ravi our server was very good. Delicious Dosas and Mango Lassi =) My Favorite in the city.", "identified_foods": ["mango"]}, {"rating": "5.0", "review": "Excellent Dosas! Great service from Vijay! Nothing like it!", "identified_foods": []}, {"rating": "5.0", "review": "Thanks to Vijay ji for the lovely hospitality and the smile on his face.\nFood is always good and refreshing with the bomb of flavours", "identified_foods": ["hospitality"]}, {"rating": "5.0", "review": "Coming from Switzerland and had my 1st experience in a Saravanaa Bhavan. What to say?! Excellent food, excellent place and excellent service!!! Vijay was sooo friendly and still professional. We loved his service at most.", "identified_foods": []}, {"rating": "5.0", "review": "Really good food and excellent service from Vijay! Highly recommend", "identified_foods": []}, {"rating": "5.0", "review": "We absolutely loved the food! Vijay was amazing and so kind! I would absolutely recommend this restaurant to everyone! :)", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was terrific, he was our server and very lovely. The food is delicious and authentic and fresh, and I’ll be coming back.", "identified_foods": []}, {"rating": "5.0", "review": "South Indian Thaali is a must try in this restaurant. Don’t forget to say hi to Vijay there. Very friendly and good human being. You will enjoy his company.", "identified_foods": []}, {"rating": "5.0", "review": "these guys are the best and the chai is off the hook!!!\n\nTell Vijay i sent ‘cha!\n\n🔥😋👍", "identified_foods": ["chai"]}, {"rating": "5.0", "review": "great food and service, and our server vijay was nice and helpful", "identified_foods": []}, {"rating": "5.0", "review": "Such a wonderful restaurant! Great service from Vijay, highly recommend for a birthday experience - beautiful food and amazing service.", "identified_foods": []}, {"rating": "5.0", "review": "Thought the prices were expensive but worth the price and I recommend getting the mini tiffin thali it is the best", "identified_foods": []}, {"rating": "5.0", "review": "The service was really nice from the staff, such as Mr. Vijay, and the food was great.", "identified_foods": []}, {"rating": "5.0", "review": "Planning our NYC trip without visiting Saravanaa Bhavan is a no brainer.With Vijay as our server, we were welcomed like family.The food was delicious and brought back nostalgia!Would always suggest to visit again when in NYC to get quality, delicious Indian food!", "identified_foods": []}, {"rating": "5.0", "review": "The food was quickly served and delicious. We seated promptly, and Vijay and the rest of the staff were very kind.", "identified_foods": []}, {"rating": "5.0", "review": "What a delightful size of dosa. Come here just to see the dosa architecture! I made an exception for a small to-go single-use wrapper so that I could save every bite. Definitely straight out of SE Asia and some excellent chutneys. The Mysore (spicy) dosa warmed me up on a cold day and could even have been hotter. Thank you Lincoln and the team.", "identified_foods": ["chutneys", "mysore"]}, {"rating": "5.0", "review": "Amazing food. Some of the best South Indian food in NYC. Much better than the Lexington Ave location. Vijay gives the best service. Would reccommend!", "identified_foods": []}, {"rating": "5.0", "review": "Good food. Dosa was amazing. Vijay was our server. He was very friendly and helpful.", "identified_foods": []}, {"rating": "5.0", "review": "Food was great and our server Vijay was very helpful and kind :)", "identified_foods": []}, {"rating": "5.0", "review": "Great Indian food with great ambience.  Spacious, and Vijay is an awesome server.", "identified_foods": []}, {"rating": "5.0", "review": "Saravanaa Bhavan is my favorite place to have authentic South Indian food in NYC. Vijay Anna is the sweetest person ever, every time I go he makes sure to come and greet my friends and I. Medu Vada at Saravanaa Bhavan for life!", "identified_foods": ["vada", "saravanaa bhavan", "life"]}, {"rating": "5.0", "review": "Thank you for the sumptuous food and for the warm hospitality by Vijay.", "identified_foods": ["hospitality"]}, {"rating": "5.0", "review": "Vijay is super nice. Brought us dessert. Dosas are perfect - Rava and Paper both really well done.", "identified_foods": []}, {"rating": "5.0", "review": "Good food great experience.Vijay welcomed us well and you can have a good time here", "identified_foods": []}, {"rating": "1.0", "review": "Arrogant staff. The waiter forgot about our order and kept on serving other customers who came after us. When we objected, he started showing the time when he entered our order in the system. He doesn’t know how to talk to customers. Also, he served burnt dosa (see the pic attached). Stay away from this place. Other sarvaana bhawans are far better in terms of food, service and seating.", "identified_foods": ["system"]}, {"rating": "5.0", "review": "In my list of worth it places; Saravana Bhavan is the No.1, I could wait in line hours if I had to, in order to get my delicious south indian delicacies, because it is thaaaaaaat WORTH IT!! I can guarantee the freshness of each and every dishes presented in HSB, it is made with so much passion and dedication; and this reflects everytime you order a dish you will get the same promising flavor EVERTIME!! that shows how consistent the staff are which is a absolute plus. Amongst all the mouth watering dishes my favourite are Onion Rava Masala Dosa and 3pc Idly; I am telling you these two together never can go wrong. I have been to all three location and the variety of service is commendable. I could see the hardwork put by the new management, yup!! The management changed. Overall, very enticing (in a good way) 😌 NO.1 🥇", "identified_foods": ["rava", "masala"]}, {"rating": "5.0", "review": "This place is delicious and the service is great! Will be coming back often :)", "identified_foods": []}, {"rating": "5.0", "review": "Excellent indian food, some of the best I had. After spending 6 months in India I was super excited to try this place, and it was wonderful. Their Dosa and special talli were both perfect and made me feel like I'm back in south India. I'll be back for sure.", "identified_foods": []}, {"rating": "5.0", "review": "This is our favorite Indian restaurant in NYC! As vegetarians our struggle is usually not finding great options on menus, but we have the opposite problem here: everything is vegetarian and AMAZING so it’s hard to choose! It’s a simple place but the food is so complex and delicious :)", "identified_foods": []}, {"rating": "5.0", "review": "Awesome dosas and great service by Mr. Vijay!", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Vijay is the sweetest server in NYC. Come here for him, if not for the amazing South Indian food.", "identified_foods": []}, {"rating": "5.0", "review": "Best place to get my filter coffee and dosa fix. Also, Vijay is a really kind and funny server.", "identified_foods": ["filter coffee"]}, {"rating": "1.0", "review": "I typically don’t write reviews,  but I am compelled to write one. I have been to SB on lex avenue and never had a bad experience. Yesterday, for the first time I threw up eating at Amsterdam location. Sitting next to kitchen, only thing freshly made is dosa. Otherwise many things from thali are heated in microwave. Disappointed. For sure will never return to this location.", "identified_foods": ["microwave"]}, {"rating": "5.0", "review": "good food. place is a bit dated, fan is too noisy but still worth it", "identified_foods": []}, {"rating": "5.0", "review": "Mr. Vijay was most welcome and the food was massively divine in every sense", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was the best! Give him a raise. Loved the food, especially the payasam.", "identified_foods": []}, {"rating": "5.0", "review": "Extremely tasty Kosher Indian food for a reasonable price in Manhattan. Nice atmosphere for a date and great service!", "identified_foods": []}, {"rating": "5.0", "review": "Good food and great service by Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "This place has some of the best South Indian food around.  It's a worldwide chain in fact.  The staff is very friendly.", "identified_foods": []}, {"rating": "5.0", "review": "The food was awesome and waiter Vijay provided a great service.", "identified_foods": []}, {"rating": "5.0", "review": "Thank you for your kind service, Vajey! Really appreciate the great food", "identified_foods": []}, {"rating": "5.0", "review": "Yummy food !! The filter coffee is killer as always.. Viji was super fun to talk to :)", "identified_foods": ["coffee"]}, {"rating": "5.0", "review": "One of the best South Indian places in Manhattan. Hands down. Service was amazing.", "identified_foods": []}, {"rating": "5.0", "review": "Food is delicious and service by vijay is excellent 👌🏻 Highly recommended", "identified_foods": []}, {"rating": "5.0", "review": "The best Massal Dosa out of the south of India.", "identified_foods": []}, {"rating": "5.0", "review": "Authentic South Indian food in the heart of Nyc! The best waiter award goes to Vijay 😁", "identified_foods": []}, {"rating": "5.0", "review": "Waiter Vijay was amazing even brought me a free sample when I was scared it would be too spicy .  food and service overall  was superb both times ive been here.", "identified_foods": []}, {"rating": "5.0", "review": "We went for dinner at the Amsterdam location! Mr Vijay provided us exceptional service and the food was very delicious.", "identified_foods": []}, {"rating": "5.0", "review": "Our waiter Vijay is really great and fun to talk to. I especially like the parottha!", "identified_foods": []}, {"rating": "5.0", "review": "Surprised that food tastes the same as I had in Chennai. Delicious 👍", "identified_foods": []}, {"rating": "5.0", "review": "Authentic South Indian Food, with good ambience. I like to eat Rasam Vada a lot as it is very light and good for stomach. The staff is very friendly. One of my favorite Indian restaurants.", "identified_foods": ["vada"]}, {"rating": "5.0", "review": "This place is great. Will definitely come back. Awesome service, props to Vijay!", "identified_foods": ["props"]}, {"rating": "5.0", "review": "Amazing place! Vijay made our lunch so special :) Best dosa in the city!!!!!!", "identified_foods": []}, {"rating": "5.0", "review": "Food was excellent.\nAwesome friendly service by Illaiyathalapathi (Vijay)", "identified_foods": []}, {"rating": "5.0", "review": "Food was good, service was great! Especially our waiter Vijay! Very nice, great guy", "identified_foods": []}, {"rating": "5.0", "review": "Had a great time here and the food was really good. Vijay was really sweet and really helped a lot.", "identified_foods": []}, {"rating": "5.0", "review": "Service is excellent as well as food. Quite the delicacy any Indian would like to have from Southern India", "identified_foods": []}, {"rating": "5.0", "review": "Food was delicious - pav bhajis were the favourite. Service was great - Vijay really made us feel at home.", "identified_foods": []}, {"rating": "5.0", "review": "Sarvana Bhavan is ❤️. Vijay is awesome!", "identified_foods": []}, {"rating": "5.0", "review": "This is an amazing place. Definitely try Cheese Dosa. If you are hungry, have some masala added inside. Thali is great here, too. Vijay is also a very amazing server. He is very kind and took great care of us. Will definitely come back again.", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "I loved eating here! The food was very good and Vijay was incredibly helpful!", "identified_foods": []}, {"rating": "5.0", "review": "great restaurant with great food and Vijay was very helpful and warm! This is my go to place for Indian food.", "identified_foods": []}, {"rating": "5.0", "review": "Vijay took care of us very well and the food is really good! Thank you!", "identified_foods": []}, {"rating": "5.0", "review": "Food is amazing and Vijay treated us with the best service!", "identified_foods": []}, {"rating": "5.0", "review": "Really good food, had an amazing time! Our server was Vijay and he totally made us feel at home!", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food and great service by Vijay !! Definitely will come back.", "identified_foods": []}, {"rating": "5.0", "review": "Food was excellent and our server Vijay, was very helpful and friendly! Would definitely visit again.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food ... Authentic South Indian taste.. a very friendly host (Mr. Vijay) right from starters to meals to desserts was on point.. business meals were very good. Mix veg parotta drove me nostalgic, reminding me of Chennai\n\nMy top 3 reasons for recommending this branch:\nAuthentic taste\nBrilliant service (again thanks to Mr Vijay)\nGood spread for varying party( I had tiffin. Rest of my family enjoyed meals with complete satisfaction)", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was our waiter and he was great!! He gave us a bunch of free treats and we loved his company", "identified_foods": []}, {"rating": "5.0", "review": "Best service in town with really friendly and welcoming people especially Mr.Vijay who works there.", "identified_foods": []}, {"rating": "4.0", "review": "Consistently good", "identified_foods": []}, {"rating": "5.0", "review": "Just loved this place! Really authentic Indian food and a nice place to hang. We were visiting from Brazil and heard about the place and it was totally worth it! The server Vijay was so nice and made the experience even better. Order the Masala Dosa, I can assure you’ll love it!", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Excellent food and very timely and good service by Mr.Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "The best dosa in NYC..it gives you a very homely feeling and waiters are really friendly..ask for vijay when you are there, he is very sweet and helpful", "identified_foods": []}, {"rating": "5.0", "review": "Vijay Vijay Vijay is very good excellent service and find out the fight will give him OK voice yeah", "identified_foods": []}, {"rating": "5.0", "review": "authentic South Indian food and very nice service from Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "Great food , solid service by thiru Vijay", "identified_foods": ["thiru"]}, {"rating": "3.0", "review": "Food was good but was not do great.", "identified_foods": []}, {"rating": "4.0", "review": "Food wise everything is very good. We ordered a meals everything was authentic. The ambiance could be improved a bit & the ac could be serviced. Other than that everything is good.", "identified_foods": []}, {"rating": "5.0", "review": "Great food and great service by our server, Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was a great host and of course the food is amazing as always", "identified_foods": []}, {"rating": "5.0", "review": "Great service, and delicious dosas and idli! Our favorite is the Rava Masala and Mini Idlis. The staff here is great, especially Vijay!", "identified_foods": ["dosas", "rava", "masala"]}, {"rating": "5.0", "review": "Great service from Vijay and great food as always", "identified_foods": []}, {"rating": "5.0", "review": "Authentic South Indian cuisine which is true to its roots.", "identified_foods": ["cuisine"]}, {"rating": "5.0", "review": "This was my first time eating at Saravanaa Bhavan, and the food was delicious. I tried the Rava Masala Dosa, Mysore Masala Dosa, Medhu Vada, onion chili uttapam, kesari rice and filter coffee. Vijay was so attentive and made sure we were enjoying our food. I definitely recommend this location!", "identified_foods": ["rava", "masala", "chili", "rice", "coffee"]}, {"rating": "5.0", "review": "The onion chilli utthapan is very good. Mr. Vijay served us really well and was very sweet.\nIt has been the best experience in NYC.", "identified_foods": []}, {"rating": "1.0", "review": "Unclean place that WILL  make you sick. Have been at least six times over this year and every time found it to be unclean, unorganized (they don’t know how to seat people and no one seems in charge, new staff every few days), staff shouting at customers, refusing to serve, very chaotic. Food isn’t bad but not worth it for the lack of cleanliness and very very poor service.", "identified_foods": ["cleanliness"]}, {"rating": "1.0", "review": "One of the worst service ever seen in Saravana Bhavan. I wonder why other places are doing great. Get good service people in the restaurant otherwise close this restaurant don’t spoil your name doing this.", "identified_foods": []}, {"rating": "5.0", "review": "Eating our favorite dosa sambar and vadai in New York! All thanks to our Vijay sir for being so warm and affectionate towards us... made us feel at home 😁", "identified_foods": []}, {"rating": "4.0", "review": "Great food. Of the 5 things we ordered, only the Mysore bonda was a disappointment. The rest was amazing, especially liked the sambhar", "identified_foods": ["mysore", "sambhar"]}, {"rating": "5.0", "review": "Super nice food and service.  The idlies were Soo good", "identified_foods": []}, {"rating": "5.0", "review": "Delicious food and great service! Thank you Vijay for introducing us to southern Indian food so kindly!", "identified_foods": []}, {"rating": "5.0", "review": "Very good Indian food, perfect to share. Vijay was very friendly and good service.", "identified_foods": []}, {"rating": "5.0", "review": "Very good South Indian food and Vijay was very kind.", "identified_foods": []}, {"rating": "5.0", "review": "Vijay saved my life and inspired my palate.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food and service. Vijay is the best!", "identified_foods": []}, {"rating": "5.0", "review": "Authentic & delicious South Indian food, great service", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food! Love the Dosas", "identified_foods": []}, {"rating": "5.0", "review": "My favorite Indian restaurant in NYC!  Come for lunch for the amazing South Indian Thali. The dosas are outstanding too.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Went for lunch after visiting The Met Cloisters, the perfect spot to jump off the 1 train and grab a delicious bite in the UWS. Big fan of Vijay too 👌🏻", "identified_foods": []}, {"rating": "5.0", "review": "Their dosa are fantastic. Vijay deserves a raise!", "identified_foods": []}, {"rating": "4.0", "review": "Thanks to Vijay who is making our night lovely dinner", "identified_foods": []}, {"rating": "5.0", "review": "Good home food with excellent hospitality by Vijay.", "identified_foods": ["hospitality"]}, {"rating": "5.0", "review": "It was a really good experience the food and the staff are both very nice. Thanks Vijay for such a wonderful experience. Khadija", "identified_foods": ["khadija"]}, {"rating": "5.0", "review": "Amazing food and service! Thank you Vijay! :)", "identified_foods": []}, {"rating": "5.0", "review": "The food is amazing and the staff are super friendly! Great neighborhood spot.", "identified_foods": []}, {"rating": "5.0", "review": "Excellent meal at saravana bhavan- very good service by Vijay. Highly recommend.", "identified_foods": []}, {"rating": "5.0", "review": "Good food and good Server - Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Great dosa and amazing customer service. Would definitely recommend this place for authentic south Indian food.", "identified_foods": []}, {"rating": "5.0", "review": "The food is great! Very fresh. The palak paneer is tdf (to die for), and our waiter Vijay was very friendly!", "identified_foods": ["paneer"]}, {"rating": "5.0", "review": "Good fresh food. Friendly staff. Amazing service.", "identified_foods": []}, {"rating": "5.0", "review": "Been here a few times, and the food and service has greatly improved recently. Vijay is very friendly and helpful and always has a smile on his face. Their paper masala dosa is the best and huge.", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Vijay made the experience really special!\nWill be back soon!", "identified_foods": []}, {"rating": "1.0", "review": "The worst of all the Saravana Bhavans that I had visited. Saravana Bhavan is very very prominent in India for its healthy food and its rich taste. On the contrary, this franchise particularly is offering very cheap quality of food.\nWe ordered Idly and vada along with Mysore Bonda . I don't know about the age of the batters but I am confident they are too old!! Both idly and vada tasted sour, which they shouldn't be. The 3 chutneys they offered are all very sour. They are very cold that it seems they were kept in the fridge for so long time. Sambar is okay. Mysore Bonda is of no difference.  The name itself is Mysore Bonda but they offered someother dish which is made of Vada batter.\nDon't even know what these people are making customers to eat. I am afraid that if someone who are new to Indian food tastes this, they don't even like to eat Indian food again. Franchises like these are spoiling the rich heritage of Saravana Bhavan and hence India.\nThe only positive thing is the customer service. But that will not at all compensate what we go for to \"SARAVANA BHAVAN\".  I will happily give a negative 10 rating if its possible and never ever suggest anyone to go to this place to eat.", "identified_foods": ["vada", "batters", "vada", "chutneys", "vada"]}, {"rating": "5.0", "review": "My friends and I had a wonderful time dining there this evening! My ghee masala dosa was perfect. Beyond the food, the service was outstanding. Vijay is such a friendly man; we’ll return just for him! Five stars!", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Go here for Vijay. We love Vijay. Vijay for President!!!", "identified_foods": []}, {"rating": "5.0", "review": "Saravanaa Bhavan is my comfort place in NY! Authentic South Indian food and the best service ever. Special mention for Vijay who is always so attentive and happy to serve! Try their South Indian thali meal and of course dosas and idlis!", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Excellent dosa and idli. And the chana Batuta was great too!!", "identified_foods": []}, {"rating": "5.0", "review": "This place is going to be my new go to spot in North Manhattan, not for Indian food, but for ANY food. I had a mysore masala dosa, salted lassi, and a half cup of madras coffee.\n\nThe dosa was cooked to perfection: a great crisp, but still soft in the middle. If you like the dry heat of chutney powder, aka gunpowder, this is the best mysore style dosa I've had. The chutney powder was a nice thick paste rather than just sprinkled as an afterthought by many restaurants.\n\nThe salted lassi is simple, and refreshing, great for a hot day like today.", "identified_foods": ["masala", "coffee"]}, {"rating": "5.0", "review": "My family and I had dosa today at this location .The service here is excellent , very friendly and neatly dressed staff especially Lincon( not sure if I have the right spelling) who went above and beyond to help us . It was such a pleasant experience . Good job manager . See you soon !", "identified_foods": ["lincon"]}, {"rating": "5.0", "review": "This is the place if you want to try some authentic Indian Dosa. I have been here multiple times and the quality is always great", "identified_foods": []}, {"rating": "5.0", "review": "Awesome, Delicious vegetarian food across whole NYC! Loved it try KARA DOSAI", "identified_foods": []}, {"rating": "5.0", "review": "Excellent dosa! Awesome purely vegetarian restaurant. Thanks Vijay", "identified_foods": []}, {"rating": "5.0", "review": "Good food and just a short walk from the american museum of natural history. Special shout-out to our server vijay for the great hospitality.", "identified_foods": ["history", "hospitality"]}, {"rating": "5.0", "review": "I ordered the onion rava masala dosa. The food was delicious and well spiced, with plenty of sambar and chutney. I also ordered filter coffee which was tasty and addictive. My server Vijay was very attentive and friendly!", "identified_foods": ["masala", "coffee"]}, {"rating": "5.0", "review": "They have really good southindian food. Dosas are amazing. We had a great experience. Vijay was extremely attentive. It was a great experience overall.", "identified_foods": []}, {"rating": "5.0", "review": "The food is delicious! Vijay is the best waiter ever.", "identified_foods": []}, {"rating": "5.0", "review": "Vijay is the best waiter! Great place. Highly recommended!", "identified_foods": []}, {"rating": "5.0", "review": "We really enjoyed the very tasty food and the friendly stuff. Perfect!", "identified_foods": []}, {"rating": "5.0", "review": "Food was great, the service was even better. Vijay and the other service staff were awesome!", "identified_foods": []}, {"rating": "4.0", "review": "Excellent food. Large portions. Dirty bathrooms.", "identified_foods": []}, {"rating": "5.0", "review": "Thank you Vijay for an excellent experience!", "identified_foods": []}, {"rating": "4.0", "review": "Very crowded. Eating tables are not comfortable. The food is good enough.", "identified_foods": []}, {"rating": "5.0", "review": "Great authentic South Indian food! The servers were very cordial too, especially Vijay.", "identified_foods": []}, {"rating": "1.0", "review": "Very poor management. Need more employees to manage customers. AC doesn’t work too. The ambience of the restaurant was very very poor. Would not recommend for fine dining.", "identified_foods": []}, {"rating": "5.0", "review": "We had an incredible time at Saravana Bhavan in the upper west side! Vijay made us special custom made cold coffee. Sitting outside, we enjoyed the incredible food and service. The food came out fast and was piping hot, and we were encouraged to hang out leisurely afterwards. It was incredible, relaxing, and delicious. Perfect place!", "identified_foods": ["coffee"]}, {"rating": "5.0", "review": "Vijay our server made the experiment amazing", "identified_foods": []}, {"rating": "5.0", "review": "Good food and good server: Vijay", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food, vegetarian menu, with dosas, thalis, idly, rice dishes, masala tea+coffee, and so much more. Friendly, neighborhood place, to go to again and again. Great service from Lincoln and Vijay, and all staff. 79 Street Amsterdam Ave. location.", "identified_foods": ["rice"]}, {"rating": "5.0", "review": "So tasty! We got mushroom rogan josh and tandoor paratha! Would eat again. :) Vijay is great!", "identified_foods": ["mushroom"]}, {"rating": "5.0", "review": "A hidden gem of Indian cuisine nestled in a bustling upper West side neighborhood. The staff was attentive, informative and patiently answered all our questions. The food was absolutely amazing. Now if your an old hand to Indian food, you should know that they tone down the spice. So if you want your dosa to have a flavorful kick be sure to ask. I've been here a number of times, eating my way through the extensive menu and have yet to eat something I didn't thoroughly enjoy. I'm a personal fan of the dosa, you can never go wrong with a dosa.", "identified_foods": ["cuisine"]}, {"rating": "5.0", "review": "The food was amazing and the server Vijay Anna was the best. A must for people craving south Indian food in NYC.", "identified_foods": []}, {"rating": "5.0", "review": "Had the filter coffee and the ghee dosa on a rainy day. 10/10 would recommend!\nGreat service from Mr.Vijay :)", "identified_foods": ["coffee"]}, {"rating": "1.0", "review": "Can you give zero stars????? Came in at 10:10 pm... was told the kitchen was closed (the closing time online is 10:30pm) .. then told all they could serve was meals.. after sitting down we were presented the check before eating...when said we will pay once our dinner is done.. were told\" would you do the same in McDonalds???!!!!!!\" I end my case....saravana bhavan has lost its quality... in india..in nyc.. everywhere.. period... walked out of there without eating.. pretty proud of ourselves!!!!!", "identified_foods": []}, {"rating": "5.0", "review": "Great vegetarian food, amazing customer experience from Vijay. One of the best Saravanaa Bhavan locations I ate at.", "identified_foods": []}, {"rating": "3.0", "review": "Went during peak Sunday lunch time! No ambience or comfort. The staff were slow in making ppl seated. Food was great and taste was nearly the same I have had in India.", "identified_foods": []}, {"rating": "5.0", "review": "Good South Indian food and Masala tea", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Good ambience . Great service.  Friendly staff . Loved the way mr. Vijay had taken care of us . Keep the good work going", "identified_foods": []}, {"rating": "5.0", "review": "Everything I have tried here has been amazing. The palak panner is the best I have ever head. The wait staff is very friendly, especially Vijay. I recommend to anyone in the neighborhood!", "identified_foods": []}, {"rating": "5.0", "review": "Good food but a bit of a wait to get seated.", "identified_foods": []}, {"rating": "5.0", "review": "Food was amazing!! Vijay was a great server and very attentive.", "identified_foods": []}, {"rating": "5.0", "review": "Good food and good conversation and service by Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "Dosa masala a is okay but sambar is very good and same with dosa! Would definitely recommend. Vijay served us and was awesome!", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Excellent food n great service. I love it .", "identified_foods": []}, {"rating": "5.0", "review": "This was the best Indian food I have ever tried in my life!! Highly recommend it out and ask for Vijay to be your server, he was awesome!", "identified_foods": []}, {"rating": "5.0", "review": "Amazing Dosa, and make sure to try the Badam Halwa dessert!", "identified_foods": []}, {"rating": "5.0", "review": "Great food and service from Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "We had a wonderful meal and excellent service from Vijay! The dosas are amazing and the price can’t be beat. Absolutely would recommend!", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Great dosas, tastes as authentic as you can get in the city, my favorite is the Medhu Vada (reminds me of home). Good service as well, thanks Vijay. 10/10 would come again.", "identified_foods": []}, {"rating": "5.0", "review": "Good food quick service", "identified_foods": []}, {"rating": "5.0", "review": "Lovely food and service - Vijay is awesome!", "identified_foods": []}, {"rating": "5.0", "review": "Really good food. Vijay is a great host", "identified_foods": []}, {"rating": "5.0", "review": "Excellent food! Manager Vijay was very friendly and helpful", "identified_foods": []}, {"rating": "5.0", "review": "I loved the food. Paneer (farmer cheese) curry is my favorite.", "identified_foods": ["paneer", "curry"]}, {"rating": "4.0", "review": "Amazing presentation...good although not fabulous South Indian food. On a busy day, with many potential customers, the staff rather half heartedly let all know they would be late in opening by 30 minutes. Within minutes of actually opening, the spaces inside and out were packed...so, it must not matter...", "identified_foods": []}, {"rating": "5.0", "review": "I was there at Amsterdam Ave - Saravana Bhavan with my friends for my birthday as it's my all time favorite restaurant. Food was delicious and the service was excellent. Special thanks to Siva and Vijay for their remarkable service and for singing birthday song and sharing sweets & Savories. We had quite a lot of food vada, mini tiffin, parotta with Kurma/Vegetable curry , Chappthi, palak paneer, Tea , coffee, butter milk and so on :) If you are looking forward to tasting authentic and tasty south Indian food, this is place to go to.", "identified_foods": ["vegetable", "paneer", "milk"]}, {"rating": "5.0", "review": "If you are looking for good south Indian food near Central Park, NYC, definitely this is the place to go. I saw lot of people eating there who are not Indians. I was amazed by the quality of the food and service at a highly crowded area like this. Ghee Dosa that I had was delicious. There were friends who tried north Indian varieties like paneer and naan. They really enjoyed it.", "identified_foods": ["indians", "paneer", "naan"]}, {"rating": "5.0", "review": "Vijay was a great server the food was really good", "identified_foods": []}, {"rating": "5.0", "review": "Amazing amazing food . I’m a regular here and service is good . I love their fresh dosas .", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Love coming here for masala dosa when I’m missing home. Tried the cheese masala dosa this time and it did not disappoint. Look out for Vijay - he took great care of our party of 5!", "identified_foods": ["masala", "masala"]}, {"rating": "5.0", "review": "Food and service was great. Vijay was really friendly. Ordered a South Indian thali! Reminisced about the Chennai days! #misschennai #saravanaasalways", "identified_foods": []}, {"rating": "4.0", "review": "Very delicious, but am going to knock off a star for how poor the service is.", "identified_foods": []}, {"rating": "5.0", "review": "Good hospitality by Vijay. Professional and friendly.", "identified_foods": []}, {"rating": "5.0", "review": "This is a wonderful place that I have been coming to for a large portion of my life. Speaking of large portions, their food is immense. AND delicious. I particularly like their dal butter fry and their palak paneer is unparalleled. The dosas are without a doubt some of the best IVE ever had. Ask for Vijay, he’s a real great server. Ciao. —xoxo kim", "identified_foods": ["dal butter", "dosas"]}, {"rating": "1.0", "review": "Poor management. Waited for over an hour and they'd give your spot to someone else. Not worth the wait. Not to mention their faulty air conditioning", "identified_foods": []}, {"rating": "5.0", "review": "Vijay is kind server! The food was so good :)", "identified_foods": []}, {"rating": "5.0", "review": "Great service! Ask for thala Vijay!", "identified_foods": ["thala"]}, {"rating": "5.0", "review": "Food is excellent, service is quite friendly ! Portions are large, so order accordingly.", "identified_foods": []}, {"rating": "4.0", "review": "DELISH FOOD BIG  PORTIONS. Vijay was very generous and gave us some pineapple halwa. Bless", "identified_foods": ["pineapple"]}, {"rating": "5.0", "review": "Saravana Bhavan is always a regular stop for us when we’re craving dosa. The dosa itself is crispy at the outer layer, but still soft enough to enjoy. Potatoes and sambhar are both flavorful. This place does get crowded during busy hours, but we’ve always found the service to be good.", "identified_foods": ["sambhar"]}, {"rating": "5.0", "review": "Good food, good service esp waiter Vijay is very good and sincere.", "identified_foods": []}, {"rating": "5.0", "review": "Delicious food and great service from Vijay!!", "identified_foods": []}, {"rating": "3.0", "review": "Very less space,\nFood quality is good and tasty.\nBit costly", "identified_foods": []}, {"rating": "1.0", "review": "We are regular customers here, come atleast once a week. The place has now become progressively dirtier and the new servers are horrible. They don't know how to communicate and are downright rude. We saw two servers get into an argument once in the dining area which was extremely uncomfortable. Today when we came to have lunch the server(new person) said we are full, when we asked how much time it might take he said he doesn't know, maybe an hour and then refused to take down our names to wait for a table. Needless to say, we will not be coming here again.", "identified_foods": []}, {"rating": "5.0", "review": "Great service! Delicious South Indian food!! The dosas are exceptionally good!!", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "I absolutely love this place. The food is delicious (I usually get the mysore masala dosa or cheese masala dosa), and the service is great too. I especially like Vijay--he's a complete jokester and makes the dining experience so much better. Make sure to end your meal with a filter coffee :)", "identified_foods": ["masala", "masala", "coffee"]}, {"rating": "5.0", "review": "Delicious meal! Had to take leftovers! Highly recommend the palaak paneer!", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was awesome. Great service.", "identified_foods": []}, {"rating": "5.0", "review": "An excellent eating place which offers a large choice of vegetarian dishes.\nMany delicious meal options are available here.\n\nA wholesome option includes a selection of South India delicacies along with a sweet.\nFelt like dining at Home!\n\nBut do not prolong your lunch or dinner beyond the operating hours of the place. No service after that!", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food and service. Especially Reallyserver dolma was great. Enjoyed the Kaimai Idli and mini tiffin.", "identified_foods": []}, {"rating": "1.0", "review": "Used to be a regular here. The quality of food has reduced a bit. Went in the evening and in the next day morning again. The idlis were stale, appeared heated, and not the quality which you expect - particularly given that the prices are expensive considering the fact it's simple vegetarian food is what they deliver. Saravana in NYC is very popular and the inevitable happens to most businesses - arrogance.", "identified_foods": []}, {"rating": "5.0", "review": "I lived for 2 years in India and this place is legit. Hard to find real Madras coffee and dosa, saravanaa is where it's at! Vijay is awesome too :D", "identified_foods": ["coffee"]}, {"rating": "5.0", "review": "My favorite South Indian on the Upper West Side with the BEST idlis!!!! The buttermilk (chaas) and idlis are my go-to while the mixed vegetable parantha and parantha with 2 curries are always a treat. Also, our waiter Vijay was very friendly! Highly recommend for a great meal in a no frills setting.", "identified_foods": ["upper", "buttermilk", "vegetable", "curries"]}, {"rating": "5.0", "review": "Amazing food, lovely staff especially Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Fantastic food and friendly service!", "identified_foods": []}, {"rating": "5.0", "review": "One of the best places in the city,  definitely a must visit for everyone. The food is just like the orifniaoriginal saravana Bhavan in India. The servers were extremely nice and warm, especially the one who served my table named Vijay. He  was very nice and made us extreme comfortable and provided us with the best company.  Make sure to give Mr. Vijay a hi if you go there. The food was fresh and a definite go go to anyone craving some south indians food in NYC.", "identified_foods": ["saravana bhavan"]}, {"rating": "5.0", "review": "Great food! Come here once a month vinay always takes special care of my table.", "identified_foods": ["vinay"]}, {"rating": "5.0", "review": "Excellent food  and service. This place is right next to my apartment and Its my go-to for a great dosa. I usually order the onion rava masala dosa - its so so so good. The service is also very good. Vijay who is a server there always has a smile on his face and is very friendly. He is very patient and explains what the dishes are made of to all customers. I would definetly recommend this place. My fav!!!!", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Always great. Love the giant dosas", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Vijay was very friendly, and we thoroughly enjoyed the food and atmosphere. Thank you!!", "identified_foods": []}, {"rating": "5.0", "review": "Excellent lunch special. Loved it. The place hass no ambiance, music, vibe but the food is great", "identified_foods": []}, {"rating": "5.0", "review": "Excellent dosa, Vijay was funny efficient and  respectful", "identified_foods": []}, {"rating": "5.0", "review": "Great food, served by Mr Vijay :)", "identified_foods": []}, {"rating": "5.0", "review": "Tasty food n value for money in NYC Manhattan. Especially Thalli during weekdays it’s really cheap n good quantity of food.\nHeartful Thanks  to the manager Mr. Vijay & Co for their wonderful hospitality.", "identified_foods": ["hospitality"]}, {"rating": "5.0", "review": "Wonderful food and great service! If only my dosa was larger.", "identified_foods": []}, {"rating": "5.0", "review": "food was delicious, wait staff great, Mr. Vijay made us have a true south indian experience.", "identified_foods": []}, {"rating": "5.0", "review": "Lovely food and great service by Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Awesome South Indian food and exceptional service especially by Mr Vijay", "identified_foods": []}, {"rating": "5.0", "review": "Vijay is the man! Love this place.", "identified_foods": []}, {"rating": "5.0", "review": "Such amazing food!!! The service was great- thanks Vijay!!", "identified_foods": ["great"]}, {"rating": "4.0", "review": "Comfort food. I'm a regular here, turn up once a week for mini idli. My flatmates' first try at Indian food was here and they liked it", "identified_foods": []}, {"rating": "5.0", "review": "Good food and great service by Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "Delicious.\nAnd wonderfully friendly", "identified_foods": []}, {"rating": "5.0", "review": "authentic. delicious. great service (hi to vijay!)", "identified_foods": []}, {"rating": "2.0", "review": "Total let down from the HSB chain at an international level. Poor service, items not delivered, rasam was EXTRA EXTRA EXTRA salty. Drinks never came. Food quality disappointing. May have only been one server but he forgot things and didn't even seem to care or be sorry. Would recommend going to the other location on Lexington, if at all. So so disappointing and sad.", "identified_foods": []}, {"rating": "5.0", "review": "Suoer service by Vijay. Food was good.", "identified_foods": []}, {"rating": "5.0", "review": "Great food, and Vijay was a very friendly and helpful server.", "identified_foods": []}, {"rating": "5.0", "review": "Excellent food! Great service by Vijay!!", "identified_foods": []}, {"rating": "5.0", "review": "Awesome food. The Best in new York.", "identified_foods": []}, {"rating": "5.0", "review": "Best place for South Indian tiffins", "identified_foods": []}, {"rating": "5.0", "review": "Vijay's service is excellent", "identified_foods": []}, {"rating": "5.0", "review": "if youd like to try lots of different dishes, the lunch thali special is delicious and only $12.99\n\nVijay looked after me they also have an excellent mango lassi\nLooking forward to trying the dosas next!", "identified_foods": ["mango", "dosas"]}, {"rating": "5.0", "review": "Very nice service by Mr Vijay", "identified_foods": []}, {"rating": "5.0", "review": "Have been here multiple times. Awesome food always, especially their dosas and Madras filter coffee!", "identified_foods": ["dosas", "coffee"]}, {"rating": "5.0", "review": "All the dosas and bisibellabath were very good.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Best south Indian food in the UWS. Definitely try their Onion Rava Dosa and Mango Lassi!", "identified_foods": ["rava", "mango"]}, {"rating": "5.0", "review": "Great hospitality with welcoming Vijay sir", "identified_foods": []}, {"rating": "5.0", "review": "Great food and great service by Vijay.", "identified_foods": []}, {"rating": "5.0", "review": "My girlfriend and I came for lunch. Our waiter Vijay was excellent, the food was delicious, and very inexpensive - we had the lunch special- yum!!", "identified_foods": []}, {"rating": "5.0", "review": "Fantastic food and fantastic service thanks to Vijay", "identified_foods": []}, {"rating": "5.0", "review": "It’s a very nice place, Vijay (waiter) was very friendly n helpful, food is so good n fresh.", "identified_foods": []}, {"rating": "5.0", "review": "Really good food and service.Mr.Vijay was very sweet and accommodating!!", "identified_foods": []}, {"rating": "5.0", "review": "One of our favorite restaurants. Fantastic dosas, chickpeas, idlys and more.", "identified_foods": []}, {"rating": "4.0", "review": "Food is really authentic, but the place is too small.", "identified_foods": []}, {"rating": "5.0", "review": "Great food! Thanks vijay", "identified_foods": []}, {"rating": "5.0", "review": "Great service, excellent food. Thanks Mr. Vijay", "identified_foods": []}, {"rating": "1.0", "review": "This place was busy when we arrived. There was no host stand. When we went inside to inquire about seating, one of the 2 guys working there proceeded to yell and told us to wait outside. Even all the delivery people waiting on orders who showed up were given no attention.\nWe finally got seated inside across the server table. There was only 1 towel in there that the guys were using to wipe the tables. They used the same hands to put silverware and napkins. It was extremely unhygenic.\nThe food we ordered came quickly and didn't taste great. The next morning all 3 of us had upset stomachs. Who knows if they even washed the dishes in the back.", "identified_foods": ["tables", "unhygenic"]}, {"rating": "4.0", "review": "Food is excellent. The place is a bit congested.", "identified_foods": []}, {"rating": "5.0", "review": "Good South Indian Vegetarian food, but service can improve a lot.  They seem to have taken customers for 'granted' and gave us shoddy service.   But, the food was great.  We ordered  few Dosa varieties  & Adai Avial and they were delicious.  Would  visit again, but hoping to see much improved service can clean rest rooms.", "identified_foods": ["adai"]}, {"rating": "5.0", "review": "Amazing food!!! Also very friendly servers, thank you Vijay!", "identified_foods": []}, {"rating": "5.0", "review": "Excellent authentic food and wonderful staff!!! Vijay rocks!", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food and great service, very friendly staff", "identified_foods": []}, {"rating": "5.0", "review": "Great food and Vijay is great.", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was awesome at this restaurant the food was amazing! Great vegetarian food!", "identified_foods": []}, {"rating": "5.0", "review": "Tasty and good quality South Indian vegetarian food", "identified_foods": []}, {"rating": "5.0", "review": "Great dosa experience. Vijay took create care of us.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food. Vijay is awesome!!", "identified_foods": []}, {"rating": "5.0", "review": "The dosas, chutneys and chai were excellent.  I will be coming again often.", "identified_foods": ["chutneys"]}, {"rating": "5.0", "review": "Amazing food and service by Vijay!!!", "identified_foods": []}, {"rating": "3.0", "review": "Not worthy place to visit when you are in NY and you are an Indian. Food is very average. If you are hungry and non-indian, perhaps you may the items catered as Indian cuisine.\nSB chain in India is very good and loved by every one.\nPlease avoid this place, there are many other much better eatery joint in NY.", "identified_foods": ["cuisine"]}, {"rating": "5.0", "review": "Amazing food and great service!", "identified_foods": []}, {"rating": "5.0", "review": "Consistent and good service by Vijay", "identified_foods": []}, {"rating": "5.0", "review": "Such a good place to eat authentic south Indian food! Feels like home :)", "identified_foods": []}, {"rating": "5.0", "review": "Based on the other reviews I was not expecting much.  But to our surprise the food was excellent. Service was not bad even though it was fairly busy we were not rushed.", "identified_foods": []}, {"rating": "5.0", "review": "Great food!!! Vijay is the best.", "identified_foods": []}, {"rating": "5.0", "review": "Great service by Mr. Vijay", "identified_foods": []}, {"rating": "4.0", "review": "Everything we had was delicious and spicy. Service was quick and I found the price point to be very reasonable. The restaurant was small (like many Indian spots), so you were seated very close to other diners. My vegetarian friend found their meat-free choices to taste better than other selections he's had at other Indian restaurants. Overall, we found the quality of food to be good and the portions decent. It wasn't the best Indian food I've had, but I found it above average and look forward to going back to work my way through the menu.", "identified_foods": ["meat"]}, {"rating": "5.0", "review": "Great food, GREAT service.", "identified_foods": []}, {"rating": "3.0", "review": "Vegan southindian restaurant. Food is good ,spicey, authentic south indian. Ambience mediocre,  service average, price reasonable", "identified_foods": []}, {"rating": "4.0", "review": "Excellent food, a great lunch special; but loud, wifey slow (but friendly) service.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing service! And get the thali!!!", "identified_foods": []}, {"rating": "5.0", "review": "Excelent Indian food in the UWS", "identified_foods": []}, {"rating": "4.0", "review": "No frills restaurant with decent dosa!", "identified_foods": []}, {"rating": "5.0", "review": "Yummy food. prompt service.", "identified_foods": []}, {"rating": "4.0", "review": "Great food and personalised service .. Oliver Bangera you make it always special ! Thank you", "identified_foods": []}, {"rating": "4.0", "review": "Delicious food, average service!", "identified_foods": []}, {"rating": "4.0", "review": "Cool place, the inside is amazing . Nice decorations , but the food is average not too good but neither bad. But the menu has many  traditional Indian food.", "identified_foods": []}, {"rating": "4.0", "review": "We were craving for dosas and being an only south indian restaurant in the neighbourhood we decided to go to Saravana bhavan. It opens up for dinner at five and we were there by 5:30. It is a small restaurant so it gets filled up very quickly. As we asked for the table the guy just said there is none available , and when we asked about the wait ,he told us a group of four just came in. Then the other guy Naveen just stepped in and explained the situation so nicely and took our name. Even by taking our order, and serving us the food.\nThe food at Saravana Bhavan is really good. We love to eat,Idli, Plain paper Dosa and Rava Masala Dosa.\n\nNaveen was one man show. Taking order, Cleaning up tables so other people who are waiting can get the table fast, and serving food as well.", "identified_foods": ["dosas", "masala"]}, {"rating": "1.0", "review": "One of the rudest indian restaurant I have come across world wide. Had a hungry toddler with us so had to sit . Very untidy unhygienic , water served had oil traces and dosa pieces. So many better places are available at better prices and clean environment. The people managing are spoiling the name of Saravana bhavan.", "identified_foods": ["bhavan"]}, {"rating": "2.0", "review": "Wow--I am shocked at the reviews that mention good service; likewise, I am not surprised by the ones that refer to the service negatively. This had to have been the worst service I have ever had anywhere. 45 minutes to refill my water while other guests were coming and going, being served full meals and paying their checks. Not sure why I was ignored the entire time I was there. Neither of the two waiters acknowledged me after my food came out, for the remaining full hour of my stay. I finally got one's attention and just said, \"I'm ready to go.\" No response. Just the check.\n\nThe food itself was subpar, nothing special. I had maybe 5 bites of it. Would give this place one star, but the meal did come out pretty quickly (it was probably just sitting in a vat waiting to be reheated, though).\n\nHonestly, I have never seen wait staff less competent than these guys.", "identified_foods": ["checks"]}, {"rating": "4.0", "review": "Place is so congested even to walk. But the food was good and service is so good.", "identified_foods": []}, {"rating": "1.0", "review": "By far the worst Indian restaurant in the city..... Servers lack etiquette and should be sent home.", "identified_foods": ["etiquette"]}, {"rating": "1.0", "review": "They don't deliver on time. If you order for dinner time, half the time the food has already gone bad. And, in the restaurant, their service is pretty bad. Very disappointed with this place, even though food tastes good when it does show up and if it is not yet decomposing.", "identified_foods": []}, {"rating": "4.0", "review": "Great south Indian food, perfect for winter", "identified_foods": []}, {"rating": "4.0", "review": "Very good, tasty food and large cousine. It's even Kosher", "identified_foods": ["cousine"]}, {"rating": "4.0", "review": "Seems more like a takeout place even if it has the potential to be more than that. Best thing here:  South Indian vegetarian food. The layout is oddish. Restroom area could be tidied up...", "identified_foods": []}, {"rating": "4.0", "review": "Dinged only because some things that I felt should have been milder were spicy. But everything is excellent. I took a South-Indian newbie there tonight and she loved it, too. Really 4.75 stars. The onion bhaji is amazing, as are the thalis.", "identified_foods": []}, {"rating": "5.0", "review": "Perfect place for south Indian dishes. Authentic dosa and idli. My favourite is chilly onion rava masala dosa. Trust me doesnt get any better than that. Idli chilly is a dish that is missing in the menu. Filter coffee is the most authentic south Indian filter coffee that you will find in all of New York.", "identified_foods": ["masala", "coffee", "coffee"]}, {"rating": "5.0", "review": "Best food... a very good experience... very good hospitality... located at a walking distance from central park so great advantage if you wanna have the indian especially south indian cuisine... i enjoyed the food thoroughly taste wise and quality wise... completely satisfied as a customer", "identified_foods": ["cuisine"]}, {"rating": "5.0", "review": "Great south indian food, homely surroundings and perfect amount of flavor in all dishes. Ordered a simple dosa yet the sambhar was amazing!!!", "identified_foods": ["surroundings", "sambhar"]}, {"rating": "5.0", "review": "Vijay is amazing! Will come back for that filter coffee!", "identified_foods": ["filter"]}, {"rating": "3.0", "review": "Just ok food. Place is small and not like other places. Not up to the brand", "identified_foods": []}, {"rating": "5.0", "review": "Excellent hot meal and service!!!", "identified_foods": []}, {"rating": "3.0", "review": "Food is pretty good. But the bill is always high . The restaurant takes 15% gratuity for every order. We payed $100 for 4 dosas.... the service is also very slow and the food arrived cold.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Excellent South Indian food. Though a little expensive.", "identified_foods": []}, {"rating": "4.0", "review": "Delicious dosas.", "identified_foods": ["dosas"]}, {"rating": "4.0", "review": "Tasty and not expensive", "identified_foods": []}, {"rating": "4.0", "review": "Best vegan restaurants you will find in USA.", "identified_foods": []}, {"rating": "4.0", "review": "Good food,big helpings ! South Indian speciality . Pure Vegetarian.", "identified_foods": []}, {"rating": "1.0", "review": "I have been to this place recently with my family. We ordered 'Veg. Thali' for all. The overall experience was really bad. The place is very small with no hygiene. We reached there late night (09:30pm) and the food was ice cold. Looked like they served left over food. Plates were kept near the restroom entrance for washing. I'll never recommend this place to anyone. Saravanaa Bhavan must close down this place if they can't serve good food for $19 (higher cost than other Indian restaurants). Highly disappointed.", "identified_foods": ["0930pm"]}, {"rating": "5.0", "review": "Great place to satiate the dosa cravings!", "identified_foods": []}, {"rating": "5.0", "review": "Great food\nDelicious 😋", "identified_foods": []}, {"rating": "5.0", "review": "Vijay was great!", "identified_foods": []}, {"rating": "5.0", "review": "Love the food and the service.", "identified_foods": []}, {"rating": "3.0", "review": "Little disappointed as the Sarvanaa bhavan brand is really popular and good. Ordered cheese masala dosa, it was good but sambhar and chutneys were not upto the mark.\nApart from food ambience was good and staff was polite. Will visit it again to try different dish.", "identified_foods": ["sarvanaa", "masala"]}, {"rating": "4.0", "review": "Check out lunch special", "identified_foods": []}, {"rating": "3.0", "review": "Good vegetarian and Kosher food in a pinch, but a bit expensive for what it is, and the food is a little more processed for my taste. That's not to say it's not fresh, it's just ultra smooth. Also, there isn't anything that doesn't have any hear in it... It's all spicy. I love that part, but some of my friends and children don't seem to appreciate that so much! :)", "identified_foods": []}, {"rating": "4.0", "review": "Serves good South Indian food though the coffee tasted weird", "identified_foods": ["coffee"]}, {"rating": "5.0", "review": "Vijay was great.", "identified_foods": []}, {"rating": "4.0", "review": "food incredible. service not so much. 2 items in a 4 item order forgotten and then the server vanishes for 20 minutes.", "identified_foods": []}, {"rating": "5.0", "review": "Good coffee and breakfast food. Highly recommend", "identified_foods": ["coffee"]}, {"rating": "3.0", "review": "Food is great. Atmosphere not so great....", "identified_foods": []}, {"rating": "1.0", "review": "The food was average. Some of the items were satisfactory. But the bad customer service completely nullified anything positive I have to say about the restaurant. Our plates weren't taken away on time, food wasn't brought in on time and a tips weren't left up to the customer's choice. The toilets were out of order.", "identified_foods": []}, {"rating": "1.0", "review": "This is not true Sarvana Bhavan. Go to the one at 81 Lexington if you want to eat the true Sarvana Bhavan food", "identified_foods": []}, {"rating": "4.0", "review": "Delicious veggie south indian food. Love the onion crepes!", "identified_foods": ["crepes"]}, {"rating": "5.0", "review": "Great South Indian food. The dosas are as good as any you can get in Chennai. It is a small venue so you might have to wait a fair bit for a table.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Sweet place, lovely caring employees and great dinner-menus!", "identified_foods": []}, {"rating": "5.0", "review": "This is a popular southern Indian fast food chain. I have tried it in more than one location, the quality and taste is consistent. Not a huge Indian food fan, but this place hits the spot.", "identified_foods": []}, {"rating": "1.0", "review": "Worst service of all Sarvanna Bhavan, I have ever been to. The guys kept dumping food at the table, when we asked to hold a bit, they rudely replied that they can't. Horrible experience.. Think twice before spending here", "identified_foods": []}, {"rating": "2.0", "review": "Great food, but hard to go with a baby as the place is not equipped with even a changing table. Staff were not too helpful.", "identified_foods": []}, {"rating": "4.0", "review": "a good experience of south indian food, somewhat slow service", "identified_foods": []}, {"rating": "5.0", "review": "Great thali lunch special at a very reasonable price, extensive vegetarian menu, friendly and quick service - I loved my lunch here!", "identified_foods": []}, {"rating": "1.0", "review": "The restaurant didn't open as advertised and didn't really care how the customer waiting felt about.", "identified_foods": []}, {"rating": "1.0", "review": "Oh god this place sucks!! This is a funny story. First you enter, it looks like prison with stainless steel trays! We ordered 2 appetizers and the sampling platter. The writer brought 2 dishes, which were just ok ( not what we orders). When we asked for the entree, they waiter says: \"you had enough food\"! Confused we asked for the check. Seemed like it was time to go!!! We get the check and its two different entrees , obviously not what we ordered. But the waiter says - it's bigger and better than what you ordered . That's fine, we said. Let's just pay and get out. It turns out that they were charging us for the appetizers we never got!! Over all just sucks. AVOID AT ALL COST!", "identified_foods": []}, {"rating": "5.0", "review": "Specialist vegetarian/vegan Indian food. You won't miss the meat, promise. All the dishes we had were tasty and really filling. Loved the way they do Rottis.", "identified_foods": ["promise"]}, {"rating": "4.0", "review": "I really enjoyed the dosa! Got the mysore onion masala, which had a nice kick and plenty of flavor. A little on the pricy side but the portion was large. Would come back here again.", "identified_foods": []}, {"rating": "2.0", "review": "Top spicy and too hot....", "identified_foods": []}, {"rating": "3.0", "review": "Food is good but too pricey", "identified_foods": []}, {"rating": "5.0", "review": "Mini tiffin's are good", "identified_foods": []}, {"rating": "5.0", "review": "My kids love the dosas, for me it is the South Indian thali. Delicious and reasonably priced.", "identified_foods": []}, {"rating": "1.0", "review": "Worst food and service.. Few arrogant waiters. .pls don't visit...", "identified_foods": []}, {"rating": "4.0", "review": "The food is good. If you have south Indian food craving, this is your place! However, you should have deep pockets!", "identified_foods": ["pockets"]}, {"rating": "1.0", "review": "very poor customer service! after reaching there, no one was available with whom we could check-in for the tables; we told one of the guy at billing desk on how many seats we need, he just said OK, he did not share any ETA or took our name. After some time we checked again and no one knew we were waiting for a table! From there we had to keep a watch on tables (lol) and informed them which ones were available! Finally after an hour and 15 minutes we got a table, water and menu was not served for another 20 minutes. Some of the items that we ordered were cancelled without telling us; when we asked our server about it, he just said he canceled it on his own because those items were not available! food too was not that great, some items were cold and some were overcooked/burnt. Staff was arguing within themselves loudly and in front of guests, in the dining hall! that was quite awkward especially while you are eating. these guys are absolutely unable to handle things when it's busy. And felt it's expensive too for the quality of food that's been served", "identified_foods": ["hall"]}, {"rating": "5.0", "review": "Very good vegetarian restuarant", "identified_foods": []}, {"rating": "3.0", "review": "The food was amazing, with a great selection. Excellent choice for those who are vegetarian and looking for Indian food. The restaurant is a little small/cramped, though (so best to do take out or to book in advance / go here during off peak hours if possible). I should also caution that I've had mixed experience with the service; the first time I was there, the service was beyond reproach, but the second time, the service was disappointing; some of the people in our group were served significantly later than the others (despite having ordered at the same time) and after another table that was seated later was served and, on top of that, one of the items that was ordered was simply never brought to the table.", "identified_foods": []}, {"rating": "4.0", "review": "The food was delicious, fresh and the service was fast and friendly. The Taj Majal beer was delicious.", "identified_foods": []}, {"rating": "5.0", "review": "Good tasty food. Ambience not all that good. Service can be improved.", "identified_foods": []}, {"rating": "1.0", "review": "Pathetic place. They served spoilt / stale food, and the waiter did not even have the courtesy to apologise. He just took it away without saying a word. Don't even set foot into this restaurant if you want to eat good and safe Indian food", "identified_foods": ["apologise"]}, {"rating": "2.0", "review": "Food is delicious but not the most sanitary place. Last time I was here, the server served us some Sambar (South Indian lentil soup). When we asked for a refill, he said that they had to throw all the Sambar away because they realized that the batch had gone bad and so they didn’t have any more in the kitchen. Unsurprisingly, I had a very upset stomach a couple hours late. I gave it a two star because while the food is very good, no one wants to eat at a place that’s not clean.", "identified_foods": ["soup"]}, {"rating": "4.0", "review": "Good neighborhood Indian vegetarian restaurant, though somewhat run down", "identified_foods": []}, {"rating": "5.0", "review": "HSB always stay top in my list. Only place to taste authentic Tamil Nadu vegetarian foods. Service and people were good. Worth a visit.👈🤙", "identified_foods": ["tamil", "nadu"]}, {"rating": "5.0", "review": "Great cosas a,d generous serving of prosecco!", "identified_foods": ["prosecco"]}, {"rating": "5.0", "review": "Incredible food. Not your normal Indian, and super creative meals. And so affordable and unpretentious.", "identified_foods": []}, {"rating": "2.0", "review": "Over priced but not really worth it. Nothing bad with the food but not really worth all that hype. The service is below par. Portions are not very big and hence you will end up ordering more and then it becomes an expensive meal. The place is popular and is very clean. Vegetarian only.", "identified_foods": []}, {"rating": "4.0", "review": "Hotter than the Chennai branch in summer, the A/C is really bad. Food quality is good.\n\nSaravanna bhavan should stop making deliveries, especially for dosas and utapams that survive the delivery poorly, and are ruining the restaurant’s reputation.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Excellent delicious food!!!", "identified_foods": []}, {"rating": "2.0", "review": "Ordered pongal rice, orange kesar dessert and literally had to call the server to show that the rice lumps were dry and cooked long ago and he did not care to show some courtesy or ask for a different order. He just took it off and never came back to take the order. Would not recommend stored food. Coffee was ok.", "identified_foods": ["orange", "rice"]}, {"rating": "3.0", "review": "Could do better! For was extremely spicy for me.", "identified_foods": []}, {"rating": "5.0", "review": "Very nice place. Thali lunch special is a great deal.", "identified_foods": []}, {"rating": "5.0", "review": "Very good, not expensive and fast service 👍", "identified_foods": []}, {"rating": "5.0", "review": "Perfect place for an authentic South Indian meal. Vada, Idli and Dosas here are simply amazing!\nAlso, don't forget to have the best South Indian Filter Coffee with your meal 😀\nMust visit place if you like South Indian food!", "identified_foods": ["coffee", "with your"]}, {"rating": "1.0", "review": "Visited today around 6pm,  4 family with kids. We are so upset the service and food we got after paying high prices. The  place is not at all clean and we see flies roaming around. It took long time to get the food and the food is not worth.", "identified_foods": []}, {"rating": "4.0", "review": "Food was good and tasty. Clean environment. Tip is 17% of the bill by default.", "identified_foods": []}, {"rating": "1.0", "review": "Worst saravana Bhavan of all outlets in different parts of the world.. Actually not worthy of carrying that brand name. And also the most unhygienic place I have been in the US. Containers piled up near the toilet. Dirty toilets and the waiter oogle at people all the time. They couldn't even get the filter coffee right.", "identified_foods": ["saravana bhavan", "toilet", "filter", "coffee"]}, {"rating": "3.0", "review": "The food is great. They have an amazing cheese masala dosa, but their service is horrendous. They just give you the food and leave, so if you want a refill on your water or silverware (since they didn't give it to you in the first place), you're going to spend forever waiting. They even ignore you if you ask for something.", "identified_foods": ["masala"]}, {"rating": "5.0", "review": "Good food.", "identified_foods": []}, {"rating": "4.0", "review": "A little crowded than the other Saravana Bhavan on Lexington. Otherwise decent vegetarian food. Small portions for $20 a little spicy even for Indian palate", "identified_foods": []}, {"rating": "4.0", "review": "Great food, great staff. Would recommend making reservations became it's almost alway full!", "identified_foods": []}, {"rating": "5.0", "review": "Loved the place.", "identified_foods": []}, {"rating": "5.0", "review": "Huge menu. Ordered a meal that consisted of a number of small samples and thoroughly enjoyed getting to try so many well made items in one $20 take away \"meal(s) \"", "identified_foods": []}, {"rating": "5.0", "review": "Excellent food, friendly staff. There is an outdoor option, weather permitting. The tables can be a bit close but the food is why you are there. This is a very popular restaurant in India.", "identified_foods": []}, {"rating": "4.0", "review": "Very good tasty food items n good service", "identified_foods": []}, {"rating": "5.0", "review": "Stopped in for dinner after a really long day at work.  The south Indian Thali totally hit the spot; a good mix of savoury dishes, pickles, raita and dosa.  Would definitely recommend.", "identified_foods": []}, {"rating": "5.0", "review": "The south Indian tali is amazing. They close at certain times in the day. It's worth calling before you head there to make sure kitchen will be open", "identified_foods": []}, {"rating": "1.0", "review": "I have been to Sarvana Bhavan in other places as well but this one was the worst. Customer Service is the biggest drawback", "identified_foods": ["drawback"]}, {"rating": "5.0", "review": "Flavorful south Indian food,  well worth the trip.", "identified_foods": []}, {"rating": "5.0", "review": "Best South Indian vegetarian restaurant you will find in NYC! Known for these amazing dosas (crepes) and chutneys (dips).", "identified_foods": ["dosas", "crepes", "dips"]}, {"rating": "5.0", "review": "Great place to meet and eat. We were served by Dharma I think and he was very polite, patient and helpful!  Thanks!", "identified_foods": []}, {"rating": "4.0", "review": "Good Food but little expensive", "identified_foods": []}, {"rating": "5.0", "review": "Always a great place to go to", "identified_foods": []}, {"rating": "5.0", "review": "Best South Indian vegetarian restaurant in NYC but the service is low", "identified_foods": []}, {"rating": "5.0", "review": "Excellent food", "identified_foods": []}, {"rating": "4.0", "review": "great dosa!! can be better if they would invest in renovation of the restaurant", "identified_foods": []}, {"rating": "4.0", "review": "Good authentic south Indian  food at reasonable prices. Service can be slow during busy hours.", "identified_foods": []}, {"rating": "5.0", "review": "Good food", "identified_foods": []}, {"rating": "5.0", "review": "Authentic south Indian food and quick service.", "identified_foods": []}, {"rating": "4.0", "review": "Indian food available and served quickly.", "identified_foods": []}, {"rating": "1.0", "review": "obviously sarvanaa  bhavan is costly. still we prefer for the tasty food. comparing to other restaurant 3-4 times costlier menu, but the taste sucks.. food doesn't looks fresh. Ambiance is not great, soo congested seating and dirty toilets. we group of friends visited this place for lunch.every one ordered different menu no one is satisfied with the food.", "identified_foods": ["sarvanaa"]}, {"rating": "5.0", "review": "Having grown up eating Saravana Bhavan food in India, I wasn't sure whether I should try this place out. I was wrong\n\nTheir fare is delightfully tasty; a 90% flavor match with their food back in India, which is great! They use ghee to cook things and that definitely adds to the flavor! There's also outdoor seating so it's great for a summer day.\n\nPortion sizes are good, price is mid range. For novices, I would recommend having the mini tiffin - a brilliant sampler of many South Indian dishes, and VERY filling.", "identified_foods": []}, {"rating": "5.0", "review": "Holy cow this place has great dosas.  Be warned: if you order the fried peppers, they're very hot.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Always a great option for South Indian vegetarian food. Their dosas are great but for some reason the uttapam is usually a disappoint. The idli and vada with sambar is delicious too. I like the green and white chutneys but I'm not crazy about the red chutney. I always also get their Madras filter coffee.", "identified_foods": ["dosas", "vada", "chutneys", "chutney", "coffee"]}, {"rating": "5.0", "review": "Amazing food!! So savory😍", "identified_foods": ["savory"]}, {"rating": "5.0", "review": "Wonderful food bit pricey", "identified_foods": []}, {"rating": "1.0", "review": "Customer service is very bad. The waiter here is pretty rude. When we complaint this to the manager, they didnt even bother to even apologies. Instead they just said thats how he talks to everyone. And they are fine with treating the customers rude. I would never recommend this place to anyone.", "identified_foods": []}, {"rating": "1.0", "review": "Worst service and taste. Please don't go this restaurant. --ve 🌟 Star.", "identified_foods": []}, {"rating": "4.0", "review": "Small, cozy space. Food is almost authentic and the service is so much better than the sister outlet on Lexington Ave.", "identified_foods": ["outlet"]}, {"rating": "2.0", "review": "Don't go here during winter, this place does not have two doors. Staff is not deplomatic, they don't know how to talk to customers - little short of rude. Food is okey - not great.", "identified_foods": []}, {"rating": "5.0", "review": "Quality is very good . Very tasty doses, chutneys and sambhar.", "identified_foods": ["chutneys"]}, {"rating": "3.0", "review": "Average taste. Seems like the food served was prepared hours ago", "identified_foods": []}, {"rating": "5.0", "review": "Favorite restaraunt in NYC. Super good, no BS.", "identified_foods": []}, {"rating": "5.0", "review": "Very tasty", "identified_foods": []}, {"rating": "1.0", "review": "Very bad experience.\nPoor ambience and service. No menu for first 12 mins and than no one came for another 15 min to took order.\nWaiters are very rude.\nI will never go to this place again. Please try some other place in city. This is waste of money.", "identified_foods": ["waiters"]}, {"rating": "4.0", "review": "I wasn't quite certain what the controversy was about when I gave Magnolia Bakery a consideration as I personally found its cupcakes to be bland, flavourless, and oh so quite boring. But I do not think it is their cupcakes to boast about, I felt my tastebuds completely in awe when my eyes swept over their cake tiers and noticed their ever so famous peanut butter and jelly cake, a classic rendition of a childhood favourite. The peanut butter cake is absolutely moist with layers of grape jelly inside and frosted generously with peanut butter confection. This cake is one to be eaten immediately as I noticed the cake will become stale the following day. Another signature favourite is the classic magic bar, so big and sticky, I can never pass one of these up!\n\nBut my leading reason to why I am reviewing this Magnolia Bakery is for the gracious service we received from one of the baking girls. When my companion ordered an iced skim milk latte, the young woman who assisted us, a slightly heavyset young African American girl, accidentally used whole milk instead. When my companion stuck the straw into the drink, she screamed and immediately grabbed the drink out of his hand and tossed it out because she was under the impression that he was allergic to milk! Her concern over making a new drink for him was a kind touch [even though he did order skim milk instead], but a simple customer service like that can give an establishment a good name x", "identified_foods": ["cupcakes", "cupcakes", "cake", "peanut butter", "peanut butter", "grape", "peanut butter", "confection", "cake", "baking", "milk", "milk", "milk", "milk"]}, {"rating": "2.0", "review": "Average tasting , but good quantity  for the price paid in ny", "identified_foods": []}, {"rating": "3.0", "review": "Maintains Chennai Saravana Bhavan taste/quality standards. However, timings aren't flexible and food is overpriced.", "identified_foods": []}, {"rating": "5.0", "review": "South Indian food.. near the museum of national history in ny.", "identified_foods": []}, {"rating": "5.0", "review": "Great sauces, dosas, whole meal was fantastic. Excellent for those with gluten sensitivities.", "identified_foods": []}, {"rating": "5.0", "review": "So so good. Never disappointed.", "identified_foods": []}, {"rating": "1.0", "review": "Terrible service! Food wasn't fresh! I'm sad why  such a place is a disgrace to Excellant Indian Cuisine", "identified_foods": [" food", "such", "cuisine"]}, {"rating": "5.0", "review": "Great place!", "identified_foods": []}, {"rating": "3.0", "review": "The food is really good and that's the only reason this place is getting 3 stars; the place is really hot. They could turn on the A/C or fans, but they did not. It was really crowded and stuffy in there.", "identified_foods": []}, {"rating": "1.0", "review": "Very very very bad experience. The serving staff was very rude. He was super reluctant in explains anything in the menu.\nNo one came to take an order for the first 15 mins. Only after frantically calling them is when the order was taken. The interior is dirty and not maintained at all. The menu had tiny hair stuck in it.\nAll in all a very bad experience.", "identified_foods": []}, {"rating": "5.0", "review": "Good food and great prices...", "identified_foods": []}, {"rating": "5.0", "review": "Great food!", "identified_foods": []}, {"rating": "5.0", "review": "Good south indian food.", "identified_foods": []}, {"rating": "5.0", "review": "Good South Indian food, ghee pongal, medu vada, bhajjis, Dosas & coffee. Great spot for vegetarian lovers. They serve only vegetarian food. Has a few alcoholic beverages too.", "identified_foods": ["coffee", "beverages"]}, {"rating": "2.0", "review": "Food is tasty, however I had to wait more than 30 minutes to get the food. Messy service.", "identified_foods": []}, {"rating": "1.0", "review": "The manager ( the guy with a thin beard but no moustache - didn’t want to place flase allegation if he isn’t the real manager) is an ultimate beauty. You raise a concern on someone , he smiles & nods like “ it’s how it is, please take ir or leave it”\nUseless buggers r waiters who doesn’t even have the basic courtesy of saying “please”...\nNever ever visit here...", "identified_foods": ["beard", "moustache"]}, {"rating": "5.0", "review": "Really great vegetarian food. Just make sure you don't go around 3pm for lunch. They generally run out of dosas by then.", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Authentic food and cordial staffs...truly enjoyed lunch here", "identified_foods": []}, {"rating": "4.0", "review": "Always good food", "identified_foods": []}, {"rating": "5.0", "review": "Great vegetarian Indian food. Nice flavors and spices. Good food, good service", "identified_foods": []}, {"rating": "4.0", "review": "Really good Indian food! Yes this place is not about the greatest atmosphere or service in the world, but the food is authentic.", "identified_foods": []}, {"rating": "4.0", "review": "I really like all the breads and the thalis", "identified_foods": ["breads"]}, {"rating": "5.0", "review": "Awesome food!!! Had yummy meals after long time.", "identified_foods": []}, {"rating": "5.0", "review": "Best Indian food experience in New York till date! Do try their spread of dosas!!", "identified_foods": []}, {"rating": "5.0", "review": "Good South Indian food!", "identified_foods": []}, {"rating": "5.0", "review": "We love this place! It's better than the one in Paris. Must-have for vegetarian Indian in NYC!", "identified_foods": []}, {"rating": "2.0", "review": "Good food with really bad service.  It is a frustrating experience.", "identified_foods": []}, {"rating": "5.0", "review": "Take out and a quick walk to central park makes for a wonderful day. Incredibly tasty Dosa's and their Poori's are out of this world!", "identified_foods": []}, {"rating": "5.0", "review": "Great all veg South Indian food. Dosas, uttapams, thalis. Not fancy, but delicious.", "identified_foods": []}, {"rating": "5.0", "review": "Very good vegetarian Indian. Also, kosher.", "identified_foods": []}, {"rating": "1.0", "review": "Worst service and never experienced anywhere like.\n\nWe wen to had lunch here during memorial day and no proper service from the serving person. We ordered the Meals which is around  ~20.99$ and nothing was good except Yogurt. Small space and congested. Never had any of this kind of service in USA. Never visit this place again and you have enough Indian restaurants are there nearby. Save your bucks.", "identified_foods": ["yogurt"]}, {"rating": "5.0", "review": "Excellent south Indian food in NYC", "identified_foods": []}, {"rating": "3.0", "review": "Very small place for dining and difficult to serve. Order has been delayed and not a good service experience. But the food quality is in the standard of Saravana bhavan", "identified_foods": []}, {"rating": "3.0", "review": "Good portion and taste.. Very conjusted place.. Good spread.", "identified_foods": []}, {"rating": "4.0", "review": "good food but service sucks....food comes out late sometime", "identified_foods": []}, {"rating": "4.0", "review": "I am a native New Yorker and will keep to the directness of how we are known to be :)\n\nFood: Very Good South Indian cuisine! I recommend the Vegetable Biriyani.\nDrinks: Very good. Standard drinks.\nSpace: Good for date nights or get-togethers. They offer outdoor dining in the warmer weather months. The indoor dining area is also very intimate and casual.\nCrowd: 20s-60s (occasionally strollers and children:)) mostly locals and retirees.\nService: The staff is very professional and courteous.", "identified_foods": ["cuisine", "vegetable"]}, {"rating": "5.0", "review": "my friend Julia said the food is delicious!", "identified_foods": []}, {"rating": "3.0", "review": "This is a pretty well known south indian eatery and has branches all over the world. Their sambar is pretty good, but the rest of the food is average, that you might get in any other south indian restaurants.", "identified_foods": ["branches"]}, {"rating": "5.0", "review": "Had tasty south indian thali after a very long time.", "identified_foods": []}, {"rating": "3.0", "review": "Authentic south indian taste..", "identified_foods": []}, {"rating": "5.0", "review": "Great food in the Beeg Appil, Lip-smacking... And for God's sake, don't do a takeaway with Dosas, folks (it ain't no pizza, you know!). Do justice to the preparation and gobble \"on-site\".  'Nuff said.", "identified_foods": []}, {"rating": "3.0", "review": "Very good unusual Indian restaurant with lots of Dosas. This is not a fancy restaurant, but the food is really interesting. One word of caution: the dishes can be exremely spicy. Be careful what you order.", "identified_foods": []}, {"rating": "4.0", "review": "The taste and the ambience  is good but they charge more than the usual restaurants just for tiffins", "identified_foods": []}, {"rating": "5.0", "review": "Good service and nice outdoor area for seating.", "identified_foods": []}, {"rating": "4.0", "review": "Delicious vegetable curry with rice. Plus the garlic naan was perfectly soft and full aof flavor.  Yumm Yumm!", "identified_foods": ["vegetable", "rice", "naan"]}, {"rating": "5.0", "review": "I am a frequent visiter to this place .  The food is delicious and especially the sambar and chutneys are great . I would strongly recommend if anybody love vegetarian food and this the best place to visit. I love the ambience, friendly staff and excellent service.", "identified_foods": ["chutneys"]}, {"rating": "3.0", "review": "Tasty food but expensive and place is too small.", "identified_foods": []}, {"rating": "5.0", "review": "great quality south indian food", "identified_foods": []}, {"rating": "2.0", "review": "Went to this restaurant hoping for an authentic south indian cuisine and was left completely disappointed. The south Indian thali is overrated and overpriced. A couple of items on the thali were good, but the rest were terrible. Will never visit again.", "identified_foods": ["cuisine"]}, {"rating": "3.0", "review": "Decent dosa. Way better than Hampton chutney", "identified_foods": ["hampton", "chutney"]}, {"rating": "3.0", "review": "South Indian Vegetarian food. The coconut chutney for the dosa can be fresher.", "identified_foods": ["coconut"]}, {"rating": "5.0", "review": "Felt having food in India.. I cant find a difference from indian taste.. Good One.", "identified_foods": []}, {"rating": "5.0", "review": "Amazing South Indian food options", "identified_foods": []}, {"rating": "5.0", "review": "A pure South Indian Taste in New York.", "identified_foods": []}, {"rating": "1.0", "review": "This is the worst restaurant, not number 1 but zero for sloppy service. We waited 40 mins for food. And order was for dosa, which takes no more than 3 min to prepare. Ambience is equally horrible.", "identified_foods": []}, {"rating": "4.0", "review": "Saravannah is one restaurant in a chain of eatiries around the world.\nthey serve good solid Vegetarian food for all. NO meat in this kitchen.\nIt can be great to good.  The word is DOSA a superthin Indian crepe made from a variety of thin batter and filled with your choice of culinary treats.\nAloo Gobi a favorite- Rava Kesari for dessert is an south Indian Favorite. JB However beware delivery can be an issue.  Food Best Enjoyed There.", "identified_foods": ["meat", "batter"]}, {"rating": "5.0", "review": "Delicious food!  Friendly staff.  Saag Paneer and ghee dosa were amazing!!\n\nSecond trip...food was even better!! Paneer dosa and veg butter masala.  Heaven.", "identified_foods": ["saag", "food", "paneer", "masala"]}, {"rating": "4.0", "review": "Tasty masala dosa, but it was a little more oily than the Lexington Ave location.  Service was very polite and I also watched them deal excellently with a rude customer. Decor was not as new as the Lexington Ave location, but I did like their tables with inlaid gold designs.", "identified_foods": ["masala", "customer", "tables"]}, {"rating": "4.0", "review": "Good dosa place.", "identified_foods": []}, {"rating": "4.0", "review": "Come for the food not the service", "identified_foods": []}, {"rating": "5.0", "review": "Fantastic food and experience. Unlike any Indian food you have had before!", "identified_foods": []}, {"rating": "4.0", "review": "Try the milagai podi dosa!! It was very spicy and tasty!!", "identified_foods": ["milagai"]}, {"rating": "4.0", "review": "Dosa varieties where really good.. The final touch with Saravana bhavan filter coffee.. :) made a perfect day .. :)", "identified_foods": ["coffee"]}, {"rating": "5.0", "review": "Food is delicious but seating is limited", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food!!", "identified_foods": []}, {"rating": "5.0", "review": "Great food, the tip is included in the bill so watch that.", "identified_foods": []}, {"rating": "1.0", "review": "Horrible service, tasty food", "identified_foods": []}, {"rating": "4.0", "review": "Joint for yummy South Indian food.", "identified_foods": []}, {"rating": "3.0", "review": "No masala to be served with Dosa, no mini idlis left.. you better have menu items taken off the list as a day ends..", "identified_foods": []}, {"rating": "3.0", "review": "The vadai was soggy and old, the rest of the food was just passable. Service was indifferent at best. The prices are the highest I have ever seen at any Saravana bhavan around the world I have been to. And they add 15℅ gratuity by default. I am not going back again.", "identified_foods": []}, {"rating": "5.0", "review": "The food is awesome", "identified_foods": []}, {"rating": "5.0", "review": "One of the best authentic Indian food in NYC.", "identified_foods": []}, {"rating": "4.0", "review": "Nice Choice of Indian Food", "identified_foods": []}, {"rating": "5.0", "review": "yumm food", "identified_foods": []}, {"rating": "5.0", "review": "Umm honestly baffled how anyone could give Calle Ocho less than 5 stars. The sangria is fricken bomb, and the food is stellar as well. I love drunk brunch and I've tried a ton of places, and hands down Calle Ocho comes in at the top.\n\nThe breakfast muffins we got as an app were almost as heavenly as the homemade strawberry butter we got to smother all over them. For a meal, I got the vaca frita, which I highly recommend. Pro tip: the fresas is the best sangria so just pound down those.", "identified_foods": ["sangria", "muffins", "strawberry", "fresas", "sangria"]}, {"rating": "3.0", "review": "Good vegetarian Option - just go and eat", "identified_foods": []}, {"rating": "4.0", "review": "OK. So, as far as italian salummerias go, I have been to dozens in my lifetime and continue to explore them in my daily travels.\n\nSorriso is one of my favorites.  The sandwiches are awesome, the guys are friendly and the selection of prepared foods is always fresh.\n\nTry the 'Godfather', it is afterall supposed to be the classic italian cold-cut sandwich but \"sorriso-style\". I usually mix the peppers.  After you've had this one, then try whatever you are in the mood for on that day.  If you are disappointed yelp me, and I will buy you lunch!!", "identified_foods": ["sandwiches", "sandwich"]}, {"rating": "1.0", "review": "Some of these servers dont understand english.\ni requested idli and after 20 min i get idli sambar...\ni order plain rava, i get onion rava....\n\navoid this place....also not worth the money u pay......", "identified_foods": [""]}, {"rating": "5.0", "review": "Awesome food. Loved it with family.", "identified_foods": []}, {"rating": "5.0", "review": "Excellent Indian food - the dosa's rock!", "identified_foods": []}, {"rating": "5.0", "review": "The best place to try authentic South Indian vegetarian thali. In a thali you get to sample a upto 15 different food items. The food is tasty and worth every penny. Also, you can't leave the place without trying their filter coffee.", "identified_foods": ["coffee"]}, {"rating": "4.0", "review": "Love the food at this place. Specially the mulgaipodi dosa", "identified_foods": []}, {"rating": "1.0", "review": "The food is great but the service is god awful. Delivery is frequently over an hour late with no apologies from management", "identified_foods": []}, {"rating": "5.0", "review": "The service left a lot to be desired but the authentic south Indian fare and great prices makes up for all those flaws. Dosas, idlis, pongal, buttermilk , mango lassi . . Mmmmm", "identified_foods": ["mango"]}, {"rating": "5.0", "review": "Nice portions.", "identified_foods": []}, {"rating": "1.0", "review": "Highly disappointed with the food here! The worst payasam ever plus the poori was full of oil. Saravana bhavan has a brand and this restaurant is a let down.", "identified_foods": ["poori"]}, {"rating": "4.0", "review": "That was good, but dont pick the business lunch.", "identified_foods": []}, {"rating": "1.0", "review": "I visited this place today with family, being from India and have tasted the food in Chennai HSB I had great hopes on this place. But all the past impression vanished with the this visit. I have ordered rava dosa and mini tiffins. The food seems to be taken out from freezer, heated and served to us. Chutneys have more water than the actual substance! My problems dint end here, they did not accept my discover card for payment of the bill, there is no board at the entrance or any where that discover cards are not accepted and no reason cited when I asked for the reason.\n\nOverall the food, the service both are below par. We will never visit this place again", "identified_foods": ["board", "cards"]}, {"rating": "5.0", "review": "Good food and great service", "identified_foods": []}, {"rating": "5.0", "review": "my favorite dosa place in the city!", "identified_foods": []}, {"rating": "4.0", "review": "Good south Indian cuisine, which is otherwise hard to come by in the upper west side, hits the spot despite the \"meh\" service and decor.  A good value for nice vegetarian dishes, dosas and uttapams.", "identified_foods": ["dosas"]}, {"rating": "4.0", "review": "Consistently  good south Indian food", "identified_foods": []}, {"rating": "5.0", "review": "Very good indian food and tamilnadu food I got here...", "identified_foods": []}, {"rating": "5.0", "review": "Loved the taste here. If you love chennai food, this is the place for you. I lived in chennai for four years (I am from Telangana) and eating here reminded me of the food in chennai. We took pongal, dosa and utappam, all of them were good. Service was quick as well. But, I don't live in NY, I found this pretty good compared to the ones in DC area.", "identified_foods": []}, {"rating": "3.0", "review": "Good food. But very pricey. Also charging extra for a little extra chutney leaves a bad impression. Something for the owners to think !", "identified_foods": ["chutney"]}, {"rating": "4.0", "review": "As much as I love this place and its food, its service is absoutely horrible. The lexington ave location is much better in this regard. But please do not be turned off from this place because it is vegetarian. The dosa are amazing. All the other breads are amazing. Everthing I have ever gotten here is just so delicious. If you can sit through rude servers who ignore you for a little bit, then go to this place. Its the best.", "identified_foods": ["breads"]}, {"rating": "1.0", "review": "WE went to this restaurant to eat Dosa and Uttapam dishes and they told us the chef is on BREAK and these dishes are not available. More than half of their menu are dosa and uttapam dishes. Very disappointed that we have to eat something else and the waiters act like it is NORMAL for them and just our bad luck. totally unacceptable! they should close they restaurant if there is no chef available!\nLike going to McDonalds and Burger King and being told NO burgers for sale!", "identified_foods": ["burgers"]}, {"rating": "5.0", "review": "Try dosa it's best here", "identified_foods": []}, {"rating": "4.0", "review": "great food decent prices", "identified_foods": []}, {"rating": "3.0", "review": "Known for its food quality and service back in tamilnadu, the lexington ave and Amsterdam ave saravana bhavan lack service, hospitality....at lexington ave the main waiter is always in a hurry to make you eat fast and leave...th e amsterdam ave waiter was so rude when we arrived at 2:55 pm after a tiresome day with a toddler and we were turned down service, though the restaurant says it closes at 3pm...no apologies, no courteousness...avoid at all costs, will never visit this place again...", "identified_foods": ["hospitality"]}, {"rating": "3.0", "review": "Not up to the Mark", "identified_foods": []}, {"rating": "4.0", "review": "Excellent indian vegi one ! well done", "identified_foods": []}, {"rating": "5.0", "review": "Best South Indian Restaurant in America. Period,", "identified_foods": []}, {"rating": "5.0", "review": "South Indian heaven.", "identified_foods": []}, {"rating": "5.0", "review": "Nice workers and really good food!", "identified_foods": []}, {"rating": "5.0", "review": "Great Mysore masala dosas.", "identified_foods": ["masala"]}, {"rating": "1.0", "review": "Average food,  very costly, (two average  medu vada(1/10) 8.99) over all the place  is not so tidy.", "identified_foods": ["vada110"]}, {"rating": "5.0", "review": "Excellent food", "identified_foods": []}, {"rating": "5.0", "review": "Fantastic dosas. Feels very authentic", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Tasty food", "identified_foods": []}, {"rating": "1.0", "review": "Terrible service", "identified_foods": []}, {"rating": "1.0", "review": "They didn't have any curry available when I went", "identified_foods": ["curry"]}, {"rating": "5.0", "review": "Vijay", "identified_foods": []}, {"rating": "5.0", "review": "All one could wish for from a Sarvana bhavan.", "identified_foods": ["bhavan"]}, {"rating": "4.0", "review": "Tiffin was good.", "identified_foods": []}, {"rating": "1.0", "review": "Never try Indian foods in Indian chains in USA. the food was quiet ok and the charges were too high", "identified_foods": []}, {"rating": "4.0", "review": "Great food.", "identified_foods": []}, {"rating": "4.0", "review": "Good people", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food!!!", "identified_foods": []}, {"rating": "4.0", "review": "Decent food, small place", "identified_foods": []}, {"rating": "3.0", "review": "poor service due to limited space and hands. No match for the edison and mid town edition.", "identified_foods": []}, {"rating": "5.0", "review": "The best dosa in NY.", "identified_foods": []}, {"rating": "5.0", "review": "Good food", "identified_foods": []}, {"rating": "4.0", "review": "Very authentic", "identified_foods": []}, {"rating": "5.0", "review": "Delicious dosas and authentic feel.", "identified_foods": ["dosas"]}, {"rating": "1.0", "review": "Waste of money", "identified_foods": []}, {"rating": "1.0", "review": "Do you have a table for 5 in 5 minutes? “Yes, come in!”. 25 minutes wait", "identified_foods": []}, {"rating": "5.0", "review": "Amazing dosas", "identified_foods": ["dosas"]}, {"rating": "4.0", "review": "Ok", "identified_foods": []}, {"rating": "1.0", "review": "Lost our patronage because no phone number to ask a question.", "identified_foods": []}, {"rating": "4.0", "review": "Albeit a little expensive, the food tastes extremely authentic and enjoyable.", "identified_foods": ["albeit"]}, {"rating": "1.0", "review": "Slow service, expensive, not particularly tasty either", "identified_foods": []}, {"rating": "5.0", "review": "Delicious everytime!", "identified_foods": []}, {"rating": "1.0", "review": "Hopeless not worth", "identified_foods": []}, {"rating": "5.0", "review": "Nice Indian cousine", "identified_foods": ["cousine"]}, {"rating": "4.0", "review": "good indian vegetarian spot", "identified_foods": []}, {"rating": "5.0", "review": "Best Indian food in USA", "identified_foods": []}, {"rating": "2.0", "review": "Expensive, not tasty.", "identified_foods": []}, {"rating": "1.0", "review": "Absolute worst service! Very rude and started to defer delivery issues and hung up on us twice!!", "identified_foods": []}, {"rating": "5.0", "review": "Delicious dosas!!", "identified_foods": ["dosas"]}, {"rating": "3.0", "review": "An South Indian veg resturant ,in New york Amsterdam avenue but fairly expensive one.", "identified_foods": []}, {"rating": "4.0", "review": "A small place and not something that reminds you of the original Saravana Bhavan in India but still the food was good.", "identified_foods": []}, {"rating": "5.0", "review": "Excellent flavorful food", "identified_foods": []}, {"rating": "4.0", "review": "Authentic South Indian food", "identified_foods": []}, {"rating": "2.0", "review": "Really crappy service... No host, no one has a clue about wait list. Saw some folks waiting upwards of 20 minutes to get their credit cards back.", "identified_foods": ["cards"]}, {"rating": "5.0", "review": "Great and authentic taste of South India", "identified_foods": []}, {"rating": "5.0", "review": "Amazing food !!", "identified_foods": []}, {"rating": "5.0", "review": "🙌🏼", "identified_foods": []}, {"rating": "5.0", "review": "Excellent lunch", "identified_foods": []}, {"rating": "1.0", "review": "Bad place to eat", "identified_foods": []}, {"rating": "1.0", "review": "Very unhygienic............", "identified_foods": []}, {"rating": "4.0", "review": "Nice food , tasty", "identified_foods": []}, {"rating": "5.0", "review": "I love it", "identified_foods": []}, {"rating": "3.0", "review": "Must try dosa", "identified_foods": []}, {"rating": "4.0", "review": "Small hotel but food is ok", "identified_foods": []}, {"rating": "5.0", "review": "Delightful menu", "identified_foods": []}, {"rating": "4.0", "review": "Tasty food.", "identified_foods": []}, {"rating": "1.0", "review": "Worst service in the area", "identified_foods": []}, {"rating": "5.0", "review": "Delicious food", "identified_foods": []}, {"rating": "4.0", "review": "Nice food", "identified_foods": []}, {"rating": "2.0", "review": "Extremely poor service!", "identified_foods": []}, {"rating": "3.0", "review": "Food is good, but overpriced.", "identified_foods": []}, {"rating": "1.0", "review": "No concept of service. Avoid at all costs. They are a shame to the HSB brand.", "identified_foods": []}, {"rating": "2.0", "review": "Food is just okay, and service is meh!", "identified_foods": []}, {"rating": "1.0", "review": "Quality of the food was horrible. Portions are very small for the prices they charge.", "identified_foods": []}, {"rating": "5.0", "review": "Best of vegetarian meals", "identified_foods": []}, {"rating": "3.0", "review": "Thanks", "identified_foods": []}, {"rating": "1.0", "review": "Had only one server on a busy day. Took almost 45 minutes just to take our order. Do not go here if you have any shred of self dignity or if you are very hungry.", "identified_foods": []}, {"rating": "1.0", "review": "Very poor service, too costly .. no place for stroller or baby sitting. Too poor compared to California branches 🤔", "identified_foods": []}, {"rating": "5.0", "review": "So delicious!👍", "identified_foods": []}, {"rating": "5.0", "review": "Favorite place in Manhattan for Dosa", "identified_foods": []}, {"rating": "4.0", "review": "A bit expensive but good quality and authentic South Indian food!", "identified_foods": []}, {"rating": "1.0", "review": "Worst place ever visited", "identified_foods": []}, {"rating": "4.0", "review": "Satisfactory", "identified_foods": []}, {"rating": "2.0", "review": "Slow service...half the menu itwms were not available...mediocre food", "identified_foods": []}, {"rating": "4.0", "review": "Expensive, but tasty food", "identified_foods": []}, {"rating": "5.0", "review": "Best but little costly", "identified_foods": []}, {"rating": "5.0", "review": "Good food", "identified_foods": []}, {"rating": "5.0", "review": "tandori excellent", "identified_foods": []}, {"rating": "4.0", "review": "The dosas are amazing", "identified_foods": ["dosas"]}, {"rating": "5.0", "review": "Our go-to restaurant whenever family is in town", "identified_foods": []}, {"rating": "5.0", "review": "Awesome", "identified_foods": []}, {"rating": "3.0", "review": "Average Indian food which is overly priced, I'd rather go to Edison street and eat a meal there, you'll even save a few bucks.", "identified_foods": []}, {"rating": "4.0", "review": "Somewhat small.", "identified_foods": []}, {"rating": "5.0", "review": "Really good dosa.", "identified_foods": []}, {"rating": "5.0", "review": "Best of South Indian food!", "identified_foods": []}, {"rating": "1.0", "review": "Disappointed. After paying $14 in bridge toll and $28 for 1 hr parking, taste is not as good as other Saravana Bhavan like in Toronto", "identified_foods": ["bridge"]}, {"rating": "3.0", "review": "Only name", "identified_foods": []}, {"rating": "3.0", "review": "Good food overall.", "identified_foods": []}, {"rating": "5.0", "review": "(Translated by Google) A store specializing in Tamil Meals from Chennai. Worth going if you like Meals.\n\n(Original)\nチェンナイ発のタミルミールス専門店。ミールス好きなら行く価値あります。", "identified_foods": ["tamil"]}, {"rating": "5.0", "review": "(Translated by Google) Wow! It was too yummy 😋 Vijey was very nice\n\n(Original)\nWow! C’était trop miam 😋 Vijey était très gentil", "identified_foods": ["gentil"]}, {"rating": "5.0", "review": "(Translated by Google) Our server Vijay maju wala tha\n\n(Original)\nOur server Vijay maju Wala tha", "identified_foods": ["wala", "wala"]}, {"rating": "5.0", "review": "(Translated by Google) Really yummy Indian food\n\n(Original)\nCibo Indiano davvero buonissimo", "identified_foods": []}, {"rating": "4.0", "review": "(Translated by Google) Excellent vegetarian cuisine. Attention, very spicy kitchen!\n\n(Original)\nExcellente cuisine végétarienne. Attention, cuisine très relevée !", "identified_foods": ["cuisine", "cuisine", "cuisine"]}, {"rating": "2.0", "review": "(Translated by Google) I don't know if I should try this place. I was wrong\n\n(Original)\nNo sé si debería probar este lugar. Estaba equivocado", "identified_foods": []}, {"rating": "4.0", "review": "", "identified_foods": []}, {"rating": "1.0", "review": "", "identified_foods": []}, {"rating": "5.0", "review": "", "identified_foods": []}, {"rating": "3.0", "review": "", "identified_foods": []}, {"rating": "5.0", "review": "", "identified_foods": []}, {"rating": "5.0", "review": "", "identified_foods": []}, {"rating": "2.0", "review": "", "identified_foods": []}]}